import sys
import os
import json
from PyQt6.QtWidgets import (
    QApplication, QMainWindow, QWidget, QVBoxLayout, QPushButton, QFileDialog, QTextEdit, QLabel, QFormLayout, QStatusBar, QLineEdit, QSpinBox
)
from PyQt6.QtGui import QFont, QIcon
from PyQt6.QtCore import Qt
from tokenizers import Tokenizer, models, trainers, pre_tokenizers, decoders

class TokenizerApp(QMainWindow):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("𝐓𝐎𝐊𝐄𝐍𝐈𝐙𝐄𝐑")
        self.setGeometry(0, 0, 800, 600)
        self.setWindowIcon(QIcon("C:/Users/Olviw/OneDrive/Документы/GitHub/GUI_GPT_2/ico/Токенизатор zero.ico"))

        # Расширенный список специальных токенов
        self.default_tokens = [
            '<unk>', '<s>', '</s>', '<pad>', '<mask>',   # Базовые токены
            '<sep>', '<cls>', '<user>', '<assistant>',   # Токены для диалогов
            '<action>', '<content>', '<summary>',        # Токены для действий и содержания
            '<url>', '<web>',                            # Токены для работы с веб-данными

            # Пробелы и пунктуация
            ' ', ',', '.', '!', '—', '-', ';', ':', '(', ')', '"', '?', '«', '»', "'", '[', ']', '…',
            '{', '}', '/', '\\', '|', '@', '#', '$', '%', '^', '&', '*', '_', '+', '=', '~', '`', '<', '>', '„',
    
            # Кириллица (маленькие буквы)
            'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п',
            'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я',
    
            # Кириллица (большие буквы)
            'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П',
            'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я',
    
            # Латиница (маленькие буквы)
            'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p',
            'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
    
            # Латиница (большие буквы)
            'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P',
            'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
    
            # Цифры
            '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

            # Математические и логические символы
            '≠', '≈', '±', '√', '∞', '∫', '∑', '∏', '∂', '∇', '→', '←', '⇔', '∀', '∃', '∧', '∨', '⊥', '⊂', '⊃', 'Θ',
    
            # Символы валют
            '₽', '$', '€', '£', '¥', '₴', '₹', '₩', '฿', '₿', '¢', '৳',
            
            # Прочие символы
            '°', '©', '®', '™', '§', '¶',

            #  Диакритические знаки (латинские буквы с акцентами)
            'á', 'é', 'í', 'ó', 'ú', 'ñ', 'ü', 'ä', 'ö', 'ß', 'ç',

            # Русские слоги
            
            'аб', 'ав', 'аг', 'ад', 'аж', 'аз', 'ак', 'ал', 'ам', 'ан', 'ап', 'ар', 'ас', 'ат', 'аф', 'ах', 'ац', 'ач', 'аш', 'ащ', 
            
            'ба', 'баб', 'бав', 'баг', 'бад', 'баж', 'баз', 'бак', 'бал', 'бам', 'бан', 'бап', 'бар', 'бас', 'бат', 'баф', 'бах', 'бац', 'бач', 'баш', 'бащ', 'бе', 'беб', 'бев', 'бег', 'бед', 'беж', 'без', 'бек', 'бел', 'бем', 'бен', 'беп', 'бер', 'бес', 'бет', 'беф', 'бех', 'бец', 'беч', 'беш', 'бещ', 'би', 'биб', 'бив', 'биг', 'бид', 'биж', 'биз', 'бик', 'бил', 'бим', 'бин', 'бип', 'бир', 'бис', 'бит', 'биф', 'бих', 'биц', 'бич', 'биш', 'бищ', 'бо', 'боб', 'бов', 'бог', 'бод', 'бож', 'боз', 'бок', 'бол', 'бом', 'бон', 'боп', 'бор', 'бос', 'бот', 'боф', 'бох', 'боц', 'боч', 'бош', 'бощ', 'бу', 'буб', 'був', 'буг', 'буд', 'буж', 'буз', 'бук', 'бул', 'бум', 'бун', 'буп', 'бур', 'бус', 'бут', 'буф', 'бух', 'буц', 'буч', 'буш', 'бущ', 'бы', 'быб', 'быв', 'быг', 'быд', 'быж', 'быз', 'бык', 'был', 'бым', 'бын', 'бып', 'быр', 'быс', 'быт', 'быф', 'бых', 'быц', 'быч', 'быш', 'быщ', 'бэ', 'бэб', 'бэв', 'бэг', 'бэд', 'бэж', 'бэз', 'бэк', 'бэл', 'бэм', 'бэн', 'бэп', 'бэр', 'бэс', 'бэт', 'бэф', 'бэх', 'бэц', 'бэч', 'бэш', 'бэщ', 'бю', 'бюб', 'бюв', 'бюг', 'бюд', 'бюж', 'бюз', 'бюк', 'бюл', 'бюм', 'бюн', 'бюп', 'бюр', 'бюс', 'бют', 'бюф', 'бюх', 'бюц', 'бюч', 'бюш', 'бющ', 'бя', 'бяб', 'бяв', 'бяг', 'бяд', 'бяж', 'бяз', 'бяк', 'бял', 'бям', 'бян', 'бяп', 'бяр', 'бяс', 'бят', 'бяф', 'бях', 'бяц', 'бяч', 'бяш', 'бящ', 'бё', 'бёб', 'бёв', 'бёг', 'бёд', 'бёж', 'бёз', 'бёк', 'бёл', 'бём', 'бён', 'бёп', 'бёр', 'бёс', 'бёт', 'бёф', 'бёх', 'бёц', 'бёч', 'бёш', 'бёщ', 
            
            'ва', 'ваб', 'вав', 'ваг', 'вад', 'важ', 'ваз', 'вак', 'вал', 'вам', 'ван', 'вап', 'вар', 'вас', 'ват', 'ваф', 'вах', 'вац', 'вач', 'ваш', 'ващ', 'ве', 'веб', 'вев', 'вег', 'вед', 'веж', 'вез', 'век', 'вел', 'вем', 'вен', 'веп', 'вер', 'вес', 'вет', 'веф', 'вех', 'вец', 'веч', 'веш', 'вещ', 'ви', 'виб', 'вив', 'виг', 'вид', 'виж', 'виз', 'вик', 'вил', 'вим', 'вин', 'вип', 'вир', 'вис', 'вит', 'виф', 'вих', 'виц', 'вич', 'виш', 'вищ', 'во', 'воб', 'вов', 'вог', 'вод', 'вож', 'воз', 'вок', 'вол', 'вом', 'вон', 'воп', 'вор', 'вос', 'вот', 'воф', 'вох', 'воц', 'воч', 'вош', 'вощ', 'ву', 'вуб', 'вув', 'вуг', 'вуд', 'вуж', 'вуз', 'вук', 'вул', 'вум', 'вун', 'вуп', 'вур', 'вус', 'вут', 'вуф', 'вух', 'вуц', 'вуч', 'вуш', 'вущ', 'вы', 'выб', 'выв', 'выг', 'выд', 'выж', 'выз', 'вык', 'выл', 'вым', 'вын', 'вып', 'выр', 'выс', 'выт', 'выф', 'вых', 'выц', 'выч', 'выш', 'выщ', 'вэ', 'вэб', 'вэв', 'вэг', 'вэд', 'вэж', 'вэз', 'вэк', 'вэл', 'вэм', 'вэн', 'вэп', 'вэр', 'вэс', 'вэт', 'вэф', 'вэх', 'вэц', 'вэч', 'вэш', 'вэщ', 'вю', 'вюб', 'вюв', 'вюг', 'вюд', 'вюж', 'вюз', 'вюк', 'вюл', 'вюм', 'вюн', 'вюп', 'вюр', 'вюс', 'вют', 'вюф', 'вюх', 'вюц', 'вюч', 'вюш', 'вющ', 'вя', 'вяб', 'вяв', 'вяг', 'вяд', 'вяж', 'вяз', 'вяк', 'вял', 'вям', 'вян', 'вяп', 'вяр', 'вяс', 'вят', 'вяф', 'вях', 'вяц', 'вяч', 'вяш', 'вящ', 'вё', 'вёб', 'вёв', 'вёг', 'вёд', 'вёж', 'вёз', 'вёк', 'вёл', 'вём', 'вён', 'вёп', 'вёр', 'вёс', 'вёт', 'вёф', 'вёх', 'вёц', 'вёч', 'вёш', 'вёщ', 
            
            'га', 'габ', 'гав', 'гаг', 'гад', 'гаж', 'газ', 'гак', 'гал', 'гам', 'ган', 'гап', 'гар', 'гас', 'гат', 'гаф', 'гах', 'гац', 'гач', 'гаш', 'гащ', 'ге', 'геб', 'гев', 'гег', 'гед', 'геж', 'гез', 'гек', 'гел', 'гем', 'ген', 'геп', 'гер', 'гес', 'гет', 'геф', 'гех', 'гец', 'геч', 'геш', 'гещ', 'ги', 'гиб', 'гив', 'гиг', 'гид', 'гиж', 'гиз', 'гик', 'гил', 'гим', 'гин', 'гип', 'гир', 'гис', 'гит', 'гиф', 'гих', 'гиц', 'гич', 'гиш', 'гищ', 'го', 'гоб', 'гов', 'гог', 'год', 'гож', 'гоз', 'гок', 'гол', 'гом', 'гон', 'гоп', 'гор', 'гос', 'гот', 'гоф', 'гох', 'гоц', 'гоч', 'гош', 'гощ', 'гу', 'губ', 'гув', 'гуг', 'гуд', 'гуж', 'гуз', 'гук', 'гул', 'гум', 'гун', 'гуп', 'гур', 'гус', 'гут', 'гуф', 'гух', 'гуц', 'гуч', 'гуш', 'гущ', 'гы', 'гыб', 'гыв', 'гыг', 'гыд', 'гыж', 'гыз', 'гык', 'гыл', 'гым', 'гын', 'гып', 'гыр', 'гыс', 'гыт', 'гыф', 'гых', 'гыц', 'гыч', 'гыш', 'гыщ', 'гэ', 'гэб', 'гэв', 'гэг', 'гэд', 'гэж', 'гэз', 'гэк', 'гэл', 'гэм', 'гэн', 'гэп', 'гэр', 'гэс', 'гэт', 'гэф', 'гэх', 'гэц', 'гэч', 'гэш', 'гэщ', 'гю', 'гюб', 'гюв', 'гюг', 'гюд', 'гюж', 'гюз', 'гюк', 'гюл', 'гюм', 'гюн', 'гюп', 'гюр', 'гюс', 'гют', 'гюф', 'гюх', 'гюц', 'гюч', 'гюш', 'гющ', 'гя', 'гяб', 'гяв', 'гяг', 'гяд', 'гяж', 'гяз', 'гяк', 'гял', 'гям', 'гян', 'гяп', 'гяр', 'гяс', 'гят', 'гяф', 'гях', 'гяц', 'гяч', 'гяш', 'гящ', 'гё', 'гёб', 'гёв', 'гёг', 'гёд', 'гёж', 'гёз', 'гёк', 'гёл', 'гём', 'гён', 'гёп', 'гёр', 'гёс', 'гёт', 'гёф', 'гёх', 'гёц', 'гёч', 'гёш', 'гёщ', 
            
            'да', 'даб', 'дав', 'даг', 'дад', 'даж', 'даз', 'дак', 'дал', 'дам', 'дан', 'дап', 'дар', 'дас', 'дат', 'даф', 'дах', 'дац', 'дач', 'даш', 'дащ', 'де', 'деб', 'дев', 'дег', 'дед', 'деж', 'дез', 'дек', 'дел', 'дем', 'ден', 'деп', 'дер', 'дес', 'дет', 'деф', 'дех', 'дец', 'деч', 'деш', 'дещ', 'ди', 'диб', 'див', 'диг', 'дид', 'диж', 'диз', 'дик', 'дил', 'дим', 'дин', 'дип', 'дир', 'дис', 'дит', 'диф', 'дих', 'диц', 'дич', 'диш', 'дищ', 'до', 'доб', 'дов', 'дог', 'дод', 'дож', 'доз', 'док', 'дол', 'дом', 'дон', 'доп', 'дор', 'дос', 'дот', 'доф', 'дох', 'доц', 'доч', 'дош', 'дощ', 'ду', 'дуб', 'дув', 'дуг', 'дуд', 'дуж', 'дуз', 'дук', 'дул', 'дум', 'дун', 'дуп', 'дур', 'дус', 'дут', 'дуф', 'дух', 'дуц', 'дуч', 'душ', 'дущ', 'ды', 'дыб', 'дыв', 'дыг', 'дыд', 'дыж', 'дыз', 'дык', 'дыл', 'дым', 'дын', 'дып', 'дыр', 'дыс', 'дыт', 'дыф', 'дых', 'дыц', 'дыч', 'дыш', 'дыщ', 'дэ', 'дэб', 'дэв', 'дэг', 'дэд', 'дэж', 'дэз', 'дэк', 'дэл', 'дэм', 'дэн', 'дэп', 'дэр', 'дэс', 'дэт', 'дэф', 'дэх', 'дэц', 'дэч', 'дэш', 'дэщ', 'дю', 'дюб', 'дюв', 'дюг', 'дюд', 'дюж', 'дюз', 'дюк', 'дюл', 'дюм', 'дюн', 'дюп', 'дюр', 'дюс', 'дют', 'дюф', 'дюх', 'дюц', 'дюч', 'дюш', 'дющ', 'дя', 'дяб', 'дяв', 'дяг', 'дяд', 'дяж', 'дяз', 'дяк', 'дял', 'дям', 'дян', 'дяп', 'дяр', 'дяс', 'дят', 'дяф', 'дях', 'дяц', 'дяч', 'дяш', 'дящ', 'дё', 'дёб', 'дёв', 'дёг', 'дёд', 'дёж', 'дёз', 'дёк', 'дёл', 'дём', 'дён', 'дёп', 'дёр', 'дёс', 'дёт', 'дёф', 'дёх', 'дёц', 'дёч', 'дёш', 'дёщ', 
            
            'еб', 'ев', 'ег', 'ед', 'еж', 'ез', 'ек', 'ел', 'ем', 'ен', 'еп', 'ер', 'ес', 'ет', 'еф', 'ех', 'ец', 'еч', 'еш', 'ещ', 
            
            'жа', 'жаб', 'жав', 'жаг', 'жад', 'жаж', 'жаз', 'жак', 'жал', 'жам', 'жан', 'жап', 'жар', 'жас', 'жат', 'жаф', 'жах', 'жац', 'жач', 'жаш', 'жащ', 'же', 'жеб', 'жев', 'жег', 'жед', 'жеж', 'жез', 'жек', 'жел', 'жем', 'жен', 'жеп', 'жер', 'жес', 'жет', 'жеф', 'жех', 'жец', 'жеч', 'жеш', 'жещ', 'жи', 'жиб', 'жив', 'жиг', 'жид', 'жиж', 'жиз', 'жик', 'жил', 'жим', 'жин', 'жип', 'жир', 'жис', 'жит', 'жиф', 'жих', 'жиц', 'жич', 'жиш', 'жищ', 'жо', 'жоб', 'жов', 'жог', 'жод', 'жож', 'жоз', 'жок', 'жол', 'жом', 'жон', 'жоп', 'жор', 'жос', 'жот', 'жоф', 'жох', 'жоц', 'жоч', 'жош', 'жощ', 'жу', 'жуб', 'жув', 'жуг', 'жуд', 'жуж', 'жуз', 'жук', 'жул', 'жум', 'жун', 'жуп', 'жур', 'жус', 'жут', 'жуф', 'жух', 'жуц', 'жуч', 'жуш', 'жущ', 'жы', 'жыб', 'жыв', 'жыг', 'жыд', 'жыж', 'жыз', 'жык', 'жыл', 'жым', 'жын', 'жып', 'жыр', 'жыс', 'жыт', 'жыф', 'жых', 'жыц', 'жыч', 'жыш', 'жыщ', 'жэ', 'жэб', 'жэв', 'жэг', 'жэд', 'жэж', 'жэз', 'жэк', 'жэл', 'жэм', 'жэн', 'жэп', 'жэр', 'жэс', 'жэт', 'жэф', 'жэх', 'жэц', 'жэч', 'жэш', 'жэщ', 'жю', 'жюб', 'жюв', 'жюг', 'жюд', 'жюж', 'жюз', 'жюк', 'жюл', 'жюм', 'жюн', 'жюп', 'жюр', 'жюс', 'жют', 'жюф', 'жюх', 'жюц', 'жюч', 'жюш', 'жющ', 'жя', 'жяб', 'жяв', 'жяг', 'жяд', 'жяж', 'жяз', 'жяк', 'жял', 'жям', 'жян', 'жяп', 'жяр', 'жяс', 'жят', 'жяф', 'жях', 'жяц', 'жяч', 'жяш', 'жящ', 'жё', 'жёб', 'жёв', 'жёг', 'жёд', 'жёж', 'жёз', 'жёк', 'жёл', 'жём', 'жён', 'жёп', 'жёр', 'жёс', 'жёт', 'жёф', 'жёх', 'жёц', 'жёч', 'жёш', 'жёщ', 
            
            'за', 'заб', 'зав', 'заг', 'зад', 'заж', 'заз', 'зак', 'зал', 'зам', 'зан', 'зап', 'зар', 'зас', 'зат', 'заф', 'зах', 'зац', 'зач', 'заш', 'защ', 'зе', 'зеб', 'зев', 'зег', 'зед', 'зеж', 'зез', 'зек', 'зел', 'зем', 'зен', 'зеп', 'зер', 'зес', 'зет', 'зеф', 'зех', 'зец', 'зеч', 'зеш', 'зещ', 'зи', 'зиб', 'зив', 'зиг', 'зид', 'зиж', 'зиз', 'зик', 'зил', 'зим', 'зин', 'зип', 'зир', 'зис', 'зит', 'зиф', 'зих', 'зиц', 'зич', 'зиш', 'зищ', 'зо', 'зоб', 'зов', 'зог', 'зод', 'зож', 'зоз', 'зок', 'зол', 'зом', 'зон', 'зоп', 'зор', 'зос', 'зот', 'зоф', 'зох', 'зоц', 'зоч', 'зош', 'зощ', 'зу', 'зуб', 'зув', 'зуг', 'зуд', 'зуж', 'зуз', 'зук', 'зул', 'зум', 'зун', 'зуп', 'зур', 'зус', 'зут', 'зуф', 'зух', 'зуц', 'зуч', 'зуш', 'зущ', 'зы', 'зыб', 'зыв', 'зыг', 'зыд', 'зыж', 'зыз', 'зык', 'зыл', 'зым', 'зын', 'зып', 'зыр', 'зыс', 'зыт', 'зыф', 'зых', 'зыц', 'зыч', 'зыш', 'зыщ', 'зэ', 'зэб', 'зэв', 'зэг', 'зэд', 'зэж', 'зэз', 'зэк', 'зэл', 'зэм', 'зэн', 'зэп', 'зэр', 'зэс', 'зэт', 'зэф', 'зэх', 'зэц', 'зэч', 'зэш', 'зэщ', 'зю', 'зюб', 'зюв', 'зюг', 'зюд', 'зюж', 'зюз', 'зюк', 'зюл', 'зюм', 'зюн', 'зюп', 'зюр', 'зюс', 'зют', 'зюф', 'зюх', 'зюц', 'зюч', 'зюш', 'зющ', 'зя', 'зяб', 'зяв', 'зяг', 'зяд', 'зяж', 'зяз', 'зяк', 'зял', 'зям', 'зян', 'зяп', 'зяр', 'зяс', 'зят', 'зяф', 'зях', 'зяц', 'зяч', 'зяш', 'зящ', 'зё', 'зёб', 'зёв', 'зёг', 'зёд', 'зёж', 'зёз', 'зёк', 'зёл', 'зём', 'зён', 'зёп', 'зёр', 'зёс', 'зёт', 'зёф', 'зёх', 'зёц', 'зёч', 'зёш', 'зёщ', 
            
            'иб', 'ив', 'иг', 'ид', 'иж', 'из', 'ик', 'ил', 'им', 'ин', 'ип', 'ир', 'ис', 'ит', 'иф', 'их', 'иц', 'ич', 'иш', 'ищ', 
            
            'ка', 'каб', 'кав', 'каг', 'кад', 'каж', 'каз', 'как', 'кал', 'кам', 'кан', 'кап', 'кар', 'кас', 'кат', 'каф', 'ках', 'кац', 'кач', 'каш', 'кащ', 'ке', 'кеб', 'кев', 'кег', 'кед', 'кеж', 'кез', 'кек', 'кел', 'кем', 'кен', 'кеп', 'кер', 'кес', 'кет', 'кеф', 'кех', 'кец', 'кеч', 'кеш', 'кещ', 'ки', 'киб', 'кив', 'киг', 'кид', 'киж', 'киз', 'кик', 'кил', 'ким', 'кин', 'кип', 'кир', 'кис', 'кит', 'киф', 'ких', 'киц', 'кич', 'киш', 'кищ', 'ко', 'коб', 'ков', 'ког', 'код', 'кож', 'коз', 'кок', 'кол', 'ком', 'кон', 'коп', 'кор', 'кос', 'кот', 'коф', 'кох', 'коц', 'коч', 'кош', 'кощ', 'ку', 'куб', 'кув', 'куг', 'куд', 'куж', 'куз', 'кук', 'кул', 'кум', 'кун', 'куп', 'кур', 'кус', 'кут', 'куф', 'кух', 'куц', 'куч', 'куш', 'кущ', 'кы', 'кыб', 'кыв', 'кыг', 'кыд', 'кыж', 'кыз', 'кык', 'кыл', 'кым', 'кын', 'кып', 'кыр', 'кыс', 'кыт', 'кыф', 'кых', 'кыц', 'кыч', 'кыш', 'кыщ', 'кэ', 'кэб', 'кэв', 'кэг', 'кэд', 'кэж', 'кэз', 'кэк', 'кэл', 'кэм', 'кэн', 'кэп', 'кэр', 'кэс', 'кэт', 'кэф', 'кэх', 'кэц', 'кэч', 'кэш', 'кэщ', 'кю', 'кюб', 'кюв', 'кюг', 'кюд', 'кюж', 'кюз', 'кюк', 'кюл', 'кюм', 'кюн', 'кюп', 'кюр', 'кюс', 'кют', 'кюф', 'кюх', 'кюц', 'кюч', 'кюш', 'кющ', 'кя', 'кяб', 'кяв', 'кяг', 'кяд', 'кяж', 'кяз', 'кяк', 'кял', 'кям', 'кян', 'кяп', 'кяр', 'кяс', 'кят', 'кяф', 'кях', 'кяц', 'кяч', 'кяш', 'кящ', 'кё', 'кёб', 'кёв', 'кёг', 'кёд', 'кёж', 'кёз', 'кёк', 'кёл', 'кём', 'кён', 'кёп', 'кёр', 'кёс', 'кёт', 'кёф', 'кёх', 'кёц', 'кёч', 'кёш', 'кёщ', 
            
            'ла', 'лаб', 'лав', 'лаг', 'лад', 'лаж', 'лаз', 'лак', 'лал', 'лам', 'лан', 'лап', 'лар', 'лас', 'лат', 'лаф', 'лах', 'лац', 'лач', 'лаш', 'лащ', 'ле', 'леб', 'лев', 'лег', 'лед', 'леж', 'лез', 'лек', 'лел', 'лем', 'лен', 'леп', 'лер', 'лес', 'лет', 'леф', 'лех', 'лец', 'леч', 'леш', 'лещ', 'ли', 'либ', 'лив', 'лиг', 'лид', 'лиж', 'лиз', 'лик', 'лил', 'лим', 'лин', 'лип', 'лир', 'лис', 'лит', 'лиф', 'лих', 'лиц', 'лич', 'лиш', 'лищ', 'ло', 'лоб', 'лов', 'лог', 'лод', 'лож', 'лоз', 'лок', 'лол', 'лом', 'лон', 'лоп', 'лор', 'лос', 'лот', 'лоф', 'лох', 'лоц', 'лоч', 'лош', 'лощ', 'лу', 'луб', 'лув', 'луг', 'луд', 'луж', 'луз', 'лук', 'лул', 'лум', 'лун', 'луп', 'лур', 'лус', 'лут', 'луф', 'лух', 'луц', 'луч', 'луш', 'лущ', 'лы', 'лыб', 'лыв', 'лыг', 'лыд', 'лыж', 'лыз', 'лык', 'лыл', 'лым', 'лын', 'лып', 'лыр', 'лыс', 'лыт', 'лыф', 'лых', 'лыц', 'лыч', 'лыш', 'лыщ', 'лэ', 'лэб', 'лэв', 'лэг', 'лэд', 'лэж', 'лэз', 'лэк', 'лэл', 'лэм', 'лэн', 'лэп', 'лэр', 'лэс', 'лэт', 'лэф', 'лэх', 'лэц', 'лэч', 'лэш', 'лэщ', 'лю', 'люб', 'люв', 'люг', 'люд', 'люж', 'люз', 'люк', 'люл', 'люм', 'люн', 'люп', 'люр', 'люс', 'лют', 'люф', 'люх', 'люц', 'люч', 'люш', 'лющ', 'ля', 'ляб', 'ляв', 'ляг', 'ляд', 'ляж', 'ляз', 'ляк', 'лял', 'лям', 'лян', 'ляп', 'ляр', 'ляс', 'лят', 'ляф', 'лях', 'ляц', 'ляч', 'ляш', 'лящ', 'лё', 'лёб', 'лёв', 'лёг', 'лёд', 'лёж', 'лёз', 'лёк', 'лёл', 'лём', 'лён', 'лёп', 'лёр', 'лёс', 'лёт', 'лёф', 'лёх', 'лёц', 'лёч', 'лёш', 'лёщ', 
            
            'ма', 'маб', 'мав', 'маг', 'мад', 'маж', 'маз', 'мак', 'мал', 'мам', 'ман', 'мап', 'мар', 'мас', 'мат', 'маф', 'мах', 'мац', 'мач', 'маш', 'мащ', 'ме', 'меб', 'мев', 'мег', 'мед', 'меж', 'мез', 'мек', 'мел', 'мем', 'мен', 'меп', 'мер', 'мес', 'мет', 'меф', 'мех', 'мец', 'меч', 'меш', 'мещ', 'ми', 'миб', 'мив', 'миг', 'мид', 'миж', 'миз', 'мик', 'мил', 'мим', 'мин', 'мип', 'мир', 'мис', 'мит', 'миф', 'мих', 'миц', 'мич', 'миш', 'мищ', 'мо', 'моб', 'мов', 'мог', 'мод', 'мож', 'моз', 'мок', 'мол', 'мом', 'мон', 'моп', 'мор', 'мос', 'мот', 'моф', 'мох', 'моц', 'моч', 'мош', 'мощ', 'му', 'муб', 'мув', 'муг', 'муд', 'муж', 'муз', 'мук', 'мул', 'мум', 'мун', 'муп', 'мур', 'мус', 'мут', 'муф', 'мух', 'муц', 'муч', 'муш', 'мущ', 'мы', 'мыб', 'мыв', 'мыг', 'мыд', 'мыж', 'мыз', 'мык', 'мыл', 'мым', 'мын', 'мып', 'мыр', 'мыс', 'мыт', 'мыф', 'мых', 'мыц', 'мыч', 'мыш', 'мыщ', 'мэ', 'мэб', 'мэв', 'мэг', 'мэд', 'мэж', 'мэз', 'мэк', 'мэл', 'мэм', 'мэн', 'мэп', 'мэр', 'мэс', 'мэт', 'мэф', 'мэх', 'мэц', 'мэч', 'мэш', 'мэщ', 'мю', 'мюб', 'мюв', 'мюг', 'мюд', 'мюж', 'мюз', 'мюк', 'мюл', 'мюм', 'мюн', 'мюп', 'мюр', 'мюс', 'мют', 'мюф', 'мюх', 'мюц', 'мюч', 'мюш', 'мющ', 'мя', 'мяб', 'мяв', 'мяг', 'мяд', 'мяж', 'мяз', 'мяк', 'мял', 'мям', 'мян', 'мяп', 'мяр', 'мяс', 'мят', 'мяф', 'мях', 'мяц', 'мяч', 'мяш', 'мящ', 'мё', 'мёб', 'мёв', 'мёг', 'мёд', 'мёж', 'мёз', 'мёк', 'мёл', 'мём', 'мён', 'мёп', 'мёр', 'мёс', 'мёт', 'мёф', 'мёх', 'мёц', 'мёч', 'мёш', 'мёщ', 
            
            'на', 'наб', 'нав', 'наг', 'над', 'наж', 'наз', 'нак', 'нал', 'нам', 'нан', 'нап', 'нар', 'нас', 'нат', 'наф', 'нах', 'нац', 'нач', 'наш', 'нащ', 'не', 'неб', 'нев', 'нег', 'нед', 'неж', 'нез', 'нек', 'нел', 'нем', 'нен', 'неп', 'нер', 'нес', 'нет', 'неф', 'нех', 'нец', 'неч', 'неш', 'нещ', 'ни', 'ниб', 'нив', 'ниг', 'нид', 'ниж', 'низ', 'ник', 'нил', 'ним', 'нин', 'нип', 'нир', 'нис', 'нит', 'ниф', 'них', 'ниц', 'нич', 'ниш', 'нищ', 'но', 'ноб', 'нов', 'ног', 'нод', 'нож', 'ноз', 'нок', 'нол', 'ном', 'нон', 'ноп', 'нор', 'нос', 'нот', 'ноф', 'нох', 'ноц', 'ноч', 'нош', 'нощ', 'ну', 'нуб', 'нув', 'нуг', 'нуд', 'нуж', 'нуз', 'нук', 'нул', 'нум', 'нун', 'нуп', 'нур', 'нус', 'нут', 'нуф', 'нух', 'нуц', 'нуч', 'нуш', 'нущ', 'ны', 'ныб', 'ныв', 'ныг', 'ныд', 'ныж', 'ныз', 'нык', 'ныл', 'ным', 'нын', 'нып', 'ныр', 'ныс', 'ныт', 'ныф', 'ных', 'ныц', 'ныч', 'ныш', 'ныщ', 'нэ', 'нэб', 'нэв', 'нэг', 'нэд', 'нэж', 'нэз', 'нэк', 'нэл', 'нэм', 'нэн', 'нэп', 'нэр', 'нэс', 'нэт', 'нэф', 'нэх', 'нэц', 'нэч', 'нэш', 'нэщ', 'ню', 'нюб', 'нюв', 'нюг', 'нюд', 'нюж', 'нюз', 'нюк', 'нюл', 'нюм', 'нюн', 'нюп', 'нюр', 'нюс', 'нют', 'нюф', 'нюх', 'нюц', 'нюч', 'нюш', 'нющ', 'ня', 'няб', 'няв', 'няг', 'няд', 'няж', 'няз', 'няк', 'нял', 'ням', 'нян', 'няп', 'няр', 'няс', 'нят', 'няф', 'нях', 'няц', 'няч', 'няш', 'нящ', 'нё', 'нёб', 'нёв', 'нёг', 'нёд', 'нёж', 'нёз', 'нёк', 'нёл', 'нём', 'нён', 'нёп', 'нёр', 'нёс', 'нёт', 'нёф', 'нёх', 'нёц', 'нёч', 'нёш', 'нёщ', 
            
            'об', 'ов', 'ог', 'од', 'ож', 'оз', 'ок', 'ол', 'ом', 'он', 'оп', 'ор', 'ос', 'от', 'оф', 'ох', 'оц', 'оч', 'ош', 'ощ', 
            
            'па', 'паб', 'пав', 'паг', 'пад', 'паж', 'паз', 'пак', 'пал', 'пам', 'пан', 'пап', 'пар', 'пас', 'пат', 'паф', 'пах', 'пац', 'пач', 'паш', 'пащ', 'пе', 'пеб', 'пев', 'пег', 'пед', 'пеж', 'пез', 'пек', 'пел', 'пем', 'пен', 'пеп', 'пер', 'пес', 'пет', 'пеф', 'пех', 'пец', 'печ', 'пеш', 'пещ', 'пи', 'пиб', 'пив', 'пиг', 'пид', 'пиж', 'пиз', 'пик', 'пил', 'пим', 'пин', 'пип', 'пир', 'пис', 'пит', 'пиф', 'пих', 'пиц', 'пич', 'пиш', 'пищ', 'по', 'поб', 'пов', 'пог', 'под', 'пож', 'поз', 'пок', 'пол', 'пом', 'пон', 'поп', 'пор', 'пос', 'пот', 'поф', 'пох', 'поц', 'поч', 'пош', 'пощ', 'пу', 'пуб', 'пув', 'пуг', 'пуд', 'пуж', 'пуз', 'пук', 'пул', 'пум', 'пун', 'пуп', 'пур', 'пус', 'пут', 'пуф', 'пух', 'пуц', 'пуч', 'пуш', 'пущ', 'пы', 'пыб', 'пыв', 'пыг', 'пыд', 'пыж', 'пыз', 'пык', 'пыл', 'пым', 'пын', 'пып', 'пыр', 'пыс', 'пыт', 'пыф', 'пых', 'пыц', 'пыч', 'пыш', 'пыщ', 'пэ', 'пэб', 'пэв', 'пэг', 'пэд', 'пэж', 'пэз', 'пэк', 'пэл', 'пэм', 'пэн', 'пэп', 'пэр', 'пэс', 'пэт', 'пэф', 'пэх', 'пэц', 'пэч', 'пэш', 'пэщ', 'пю', 'пюб', 'пюв', 'пюг', 'пюд', 'пюж', 'пюз', 'пюк', 'пюл', 'пюм', 'пюн', 'пюп', 'пюр', 'пюс', 'пют', 'пюф', 'пюх', 'пюц', 'пюч', 'пюш', 'пющ', 'пя', 'пяб', 'пяв', 'пяг', 'пяд', 'пяж', 'пяз', 'пяк', 'пял', 'пям', 'пян', 'пяп', 'пяр', 'пяс', 'пят', 'пяф', 'пях', 'пяц', 'пяч', 'пяш', 'пящ', 'пё', 'пёб', 'пёв', 'пёг', 'пёд', 'пёж', 'пёз', 'пёк', 'пёл', 'пём', 'пён', 'пёп', 'пёр', 'пёс', 'пёт', 'пёф', 'пёх', 'пёц', 'пёч', 'пёш', 'пёщ', 
            
            'ра', 'раб', 'рав', 'раг', 'рад', 'раж', 'раз', 'рак', 'рал', 'рам', 'ран', 'рап', 'рар', 'рас', 'рат', 'раф', 'рах', 'рац', 'рач', 'раш', 'ращ', 'ре', 'реб', 'рев', 'рег', 'ред', 'реж', 'рез', 'рек', 'рел', 'рем', 'рен', 'реп', 'рер', 'рес', 'рет', 'реф', 'рех', 'рец', 'реч', 'реш', 'рещ', 'ри', 'риб', 'рив', 'риг', 'рид', 'риж', 'риз', 'рик', 'рил', 'рим', 'рин', 'рип', 'рир', 'рис', 'рит', 'риф', 'рих', 'риц', 'рич', 'риш', 'рищ', 'ро', 'роб', 'ров', 'рог', 'род', 'рож', 'роз', 'рок', 'рол', 'ром', 'рон', 'роп', 'рор', 'рос', 'рот', 'роф', 'рох', 'роц', 'роч', 'рош', 'рощ', 'ру', 'руб', 'рув', 'руг', 'руд', 'руж', 'руз', 'рук', 'рул', 'рум', 'рун', 'руп', 'рур', 'рус', 'рут', 'руф', 'рух', 'руц', 'руч', 'руш', 'рущ', 'ры', 'рыб', 'рыв', 'рыг', 'рыд', 'рыж', 'рыз', 'рык', 'рыл', 'рым', 'рын', 'рып', 'рыр', 'рыс', 'рыт', 'рыф', 'рых', 'рыц', 'рыч', 'рыш', 'рыщ', 'рэ', 'рэб', 'рэв', 'рэг', 'рэд', 'рэж', 'рэз', 'рэк', 'рэл', 'рэм', 'рэн', 'рэп', 'рэр', 'рэс', 'рэт', 'рэф', 'рэх', 'рэц', 'рэч', 'рэш', 'рэщ', 'рю', 'рюб', 'рюв', 'рюг', 'рюд', 'рюж', 'рюз', 'рюк', 'рюл', 'рюм', 'рюн', 'рюп', 'рюр', 'рюс', 'рют', 'рюф', 'рюх', 'рюц', 'рюч', 'рюш', 'рющ', 'ря', 'ряб', 'ряв', 'ряг', 'ряд', 'ряж', 'ряз', 'ряк', 'рял', 'рям', 'рян', 'ряп', 'ряр', 'ряс', 'рят', 'ряф', 'рях', 'ряц', 'ряч', 'ряш', 'рящ', 'рё', 'рёб', 'рёв', 'рёг', 'рёд', 'рёж', 'рёз', 'рёк', 'рёл', 'рём', 'рён', 'рёп', 'рёр', 'рёс', 'рёт', 'рёф', 'рёх', 'рёц', 'рёч', 'рёш', 'рёщ', 
            
            'са', 'саб', 'сав', 'саг', 'сад', 'саж', 'саз', 'сак', 'сал', 'сам', 'сан', 'сап', 'сар', 'сас', 'сат', 'саф', 'сах', 'сац', 'сач', 'саш', 'сащ', 'се', 'себ', 'сев', 'сег', 'сед', 'сеж', 'сез', 'сек', 'сел', 'сем', 'сен', 'сеп', 'сер', 'сес', 'сет', 'сеф', 'сех', 'сец', 'сеч', 'сеш', 'сещ', 'си', 'сиб', 'сив', 'сиг', 'сид', 'сиж', 'сиз', 'сик', 'сил', 'сим', 'син', 'сип', 'сир', 'сис', 'сит', 'сиф', 'сих', 'сиц', 'сич', 'сиш', 'сищ', 'со', 'соб', 'сов', 'сог', 'сод', 'сож', 'соз', 'сок', 'сол', 'сом', 'сон', 'соп', 'сор', 'сос', 'сот', 'соф', 'сох', 'соц', 'соч', 'сош', 'сощ', 'су', 'суб', 'сув', 'суг', 'суд', 'суж', 'суз', 'сук', 'сул', 'сум', 'сун', 'суп', 'сур', 'сус', 'сут', 'суф', 'сух', 'суц', 'суч', 'суш', 'сущ', 'сы', 'сыб', 'сыв', 'сыг', 'сыд', 'сыж', 'сыз', 'сык', 'сыл', 'сым', 'сын', 'сып', 'сыр', 'сыс', 'сыт', 'сыф', 'сых', 'сыц', 'сыч', 'сыш', 'сыщ', 'сэ', 'сэб', 'сэв', 'сэг', 'сэд', 'сэж', 'сэз', 'сэк', 'сэл', 'сэм', 'сэн', 'сэп', 'сэр', 'сэс', 'сэт', 'сэф', 'сэх', 'сэц', 'сэч', 'сэш', 'сэщ', 'сю', 'сюб', 'сюв', 'сюг', 'сюд', 'сюж', 'сюз', 'сюк', 'сюл', 'сюм', 'сюн', 'сюп', 'сюр', 'сюс', 'сют', 'сюф', 'сюх', 'сюц', 'сюч', 'сюш', 'сющ', 'ся', 'сяб', 'сяв', 'сяг', 'сяд', 'сяж', 'сяз', 'сяк', 'сял', 'сям', 'сян', 'сяп', 'сяр', 'сяс', 'сят', 'сяф', 'сях', 'сяц', 'сяч', 'сяш', 'сящ', 'сё', 'сёб', 'сёв', 'сёг', 'сёд', 'сёж', 'сёз', 'сёк', 'сёл', 'сём', 'сён', 'сёп', 'сёр', 'сёс', 'сёт', 'сёф', 'сёх', 'сёц', 'сёч', 'сёш', 'сёщ', 
            
            'та', 'таб', 'тав', 'таг', 'тад', 'таж', 'таз', 'так', 'тал', 'там', 'тан', 'тап', 'тар', 'тас', 'тат', 'таф', 'тах', 'тац', 'тач', 'таш', 'тащ', 'те', 'теб', 'тев', 'тег', 'тед', 'теж', 'тез', 'тек', 'тел', 'тем', 'тен', 'теп', 'тер', 'тес', 'тет', 'теф', 'тех', 'тец', 'теч', 'теш', 'тещ', 'ти', 'тиб', 'тив', 'тиг', 'тид', 'тиж', 'тиз', 'тик', 'тил', 'тим', 'тин', 'тип', 'тир', 'тис', 'тит', 'тиф', 'тих', 'тиц', 'тич', 'тиш', 'тищ', 'то', 'тоб', 'тов', 'тог', 'тод', 'тож', 'тоз', 'ток', 'тол', 'том', 'тон', 'топ', 'тор', 'тос', 'тот', 'тоф', 'тох', 'тоц', 'точ', 'тош', 'тощ', 'ту', 'туб', 'тув', 'туг', 'туд', 'туж', 'туз', 'тук', 'тул', 'тум', 'тун', 'туп', 'тур', 'тус', 'тут', 'туф', 'тух', 'туц', 'туч', 'туш', 'тущ', 'ты', 'тыб', 'тыв', 'тыг', 'тыд', 'тыж', 'тыз', 'тык', 'тыл', 'тым', 'тын', 'тып', 'тыр', 'тыс', 'тыт', 'тыф', 'тых', 'тыц', 'тыч', 'тыш', 'тыщ', 'тэ', 'тэб', 'тэв', 'тэг', 'тэд', 'тэж', 'тэз', 'тэк', 'тэл', 'тэм', 'тэн', 'тэп', 'тэр', 'тэс', 'тэт', 'тэф', 'тэх', 'тэц', 'тэч', 'тэш', 'тэщ', 'тю', 'тюб', 'тюв', 'тюг', 'тюд', 'тюж', 'тюз', 'тюк', 'тюл', 'тюм', 'тюн', 'тюп', 'тюр', 'тюс', 'тют', 'тюф', 'тюх', 'тюц', 'тюч', 'тюш', 'тющ', 'тя', 'тяб', 'тяв', 'тяг', 'тяд', 'тяж', 'тяз', 'тяк', 'тял', 'тям', 'тян', 'тяп', 'тяр', 'тяс', 'тят', 'тяф', 'тях', 'тяц', 'тяч', 'тяш', 'тящ', 'тё', 'тёб', 'тёв', 'тёг', 'тёд', 'тёж', 'тёз', 'тёк', 'тёл', 'тём', 'тён', 'тёп', 'тёр', 'тёс', 'тёт', 'тёф', 'тёх', 'тёц', 'тёч', 'тёш', 'тёщ', 
            
            'уб', 'ув', 'уг', 'уд', 'уж', 'уз', 'ук', 'ул', 'ум', 'ун', 'уп', 'ур', 'ус', 'ут', 'уф', 'ух', 'уц', 'уч', 'уш', 'ущ', 
            
            'фа', 'фаб', 'фав', 'фаг', 'фад', 'фаж', 'фаз', 'фак', 'фал', 'фам', 'фан', 'фап', 'фар', 'фас', 'фат', 'фаф', 'фах', 'фац', 'фач', 'фаш', 'фащ', 'фе', 'феб', 'фев', 'фег', 'фед', 'феж', 'фез', 'фек', 'фел', 'фем', 'фен', 'феп', 'фер', 'фес', 'фет', 'феф', 'фех', 'фец', 'феч', 'феш', 'фещ', 'фи', 'фиб', 'фив', 'фиг', 'фид', 'фиж', 'физ', 'фик', 'фил', 'фим', 'фин', 'фип', 'фир', 'фис', 'фит', 'фиф', 'фих', 'фиц', 'фич', 'фиш', 'фищ', 'фо', 'фоб', 'фов', 'фог', 'фод', 'фож', 'фоз', 'фок', 'фол', 'фом', 'фон', 'фоп', 'фор', 'фос', 'фот', 'фоф', 'фох', 'фоц', 'фоч', 'фош', 'фощ', 'фу', 'фуб', 'фув', 'фуг', 'фуд', 'фуж', 'фуз', 'фук', 'фул', 'фум', 'фун', 'фуп', 'фур', 'фус', 'фут', 'фуф', 'фух', 'фуц', 'фуч', 'фуш', 'фущ', 'фы', 'фыб', 'фыв', 'фыг', 'фыд', 'фыж', 'фыз', 'фык', 'фыл', 'фым', 'фын', 'фып', 'фыр', 'фыс', 'фыт', 'фыф', 'фых', 'фыц', 'фыч', 'фыш', 'фыщ', 'фэ', 'фэб', 'фэв', 'фэг', 'фэд', 'фэж', 'фэз', 'фэк', 'фэл', 'фэм', 'фэн', 'фэп', 'фэр', 'фэс', 'фэт', 'фэф', 'фэх', 'фэц', 'фэч', 'фэш', 'фэщ', 'фю', 'фюб', 'фюв', 'фюг', 'фюд', 'фюж', 'фюз', 'фюк', 'фюл', 'фюм', 'фюн', 'фюп', 'фюр', 'фюс', 'фют', 'фюф', 'фюх', 'фюц', 'фюч', 'фюш', 'фющ', 'фя', 'фяб', 'фяв', 'фяг', 'фяд', 'фяж', 'фяз', 'фяк', 'фял', 'фям', 'фян', 'фяп', 'фяр', 'фяс', 'фят', 'фяф', 'фях', 'фяц', 'фяч', 'фяш', 'фящ', 'фё', 'фёб', 'фёв', 'фёг', 'фёд', 'фёж', 'фёз', 'фёк', 'фёл', 'фём', 'фён', 'фёп', 'фёр', 'фёс', 'фёт', 'фёф', 'фёх', 'фёц', 'фёч', 'фёш', 'фёщ', 
            
            'ха', 'хаб', 'хав', 'хаг', 'хад', 'хаж', 'хаз', 'хак', 'хал', 'хам', 'хан', 'хап', 'хар', 'хас', 'хат', 'хаф', 'хах', 'хац', 'хач', 'хаш', 'хащ', 'хе', 'хеб', 'хев', 'хег', 'хед', 'хеж', 'хез', 'хек', 'хел', 'хем', 'хен', 'хеп', 'хер', 'хес', 'хет', 'хеф', 'хех', 'хец', 'хеч', 'хеш', 'хещ', 'хи', 'хиб', 'хив', 'хиг', 'хид', 'хиж', 'хиз', 'хик', 'хил', 'хим', 'хин', 'хип', 'хир', 'хис', 'хит', 'хиф', 'хих', 'хиц', 'хич', 'хиш', 'хищ', 'хо', 'хоб', 'хов', 'хог', 'ход', 'хож', 'хоз', 'хок', 'хол', 'хом', 'хон', 'хоп', 'хор', 'хос', 'хот', 'хоф', 'хох', 'хоц', 'хоч', 'хош', 'хощ', 'ху', 'хуб', 'хув', 'хуг', 'худ', 'хуж', 'хуз', 'хук', 'хул', 'хум', 'хун', 'хуп', 'хур', 'хус', 'хут', 'хуф', 'хух', 'хуц', 'хуч', 'хуш', 'хущ', 'хы', 'хыб', 'хыв', 'хыг', 'хыд', 'хыж', 'хыз', 'хык', 'хыл', 'хым', 'хын', 'хып', 'хыр', 'хыс', 'хыт', 'хыф', 'хых', 'хыц', 'хыч', 'хыш', 'хыщ', 'хэ', 'хэб', 'хэв', 'хэг', 'хэд', 'хэж', 'хэз', 'хэк', 'хэл', 'хэм', 'хэн', 'хэп', 'хэр', 'хэс', 'хэт', 'хэф', 'хэх', 'хэц', 'хэч', 'хэш', 'хэщ', 'хю', 'хюб', 'хюв', 'хюг', 'хюд', 'хюж', 'хюз', 'хюк', 'хюл', 'хюм', 'хюн', 'хюп', 'хюр', 'хюс', 'хют', 'хюф', 'хюх', 'хюц', 'хюч', 'хюш', 'хющ', 'хя', 'хяб', 'хяв', 'хяг', 'хяд', 'хяж', 'хяз', 'хяк', 'хял', 'хям', 'хян', 'хяп', 'хяр', 'хяс', 'хят', 'хяф', 'хях', 'хяц', 'хяч', 'хяш', 'хящ', 'хё', 'хёб', 'хёв', 'хёг', 'хёд', 'хёж', 'хёз', 'хёк', 'хёл', 'хём', 'хён', 'хёп', 'хёр', 'хёс', 'хёт', 'хёф', 'хёх', 'хёц', 'хёч', 'хёш', 'хёщ', 
            
            'ца', 'цаб', 'цав', 'цаг', 'цад', 'цаж', 'цаз', 'цак', 'цал', 'цам', 'цан', 'цап', 'цар', 'цас', 'цат', 'цаф', 'цах', 'цац', 'цач', 'цаш', 'цащ', 'це', 'цеб', 'цев', 'цег', 'цед', 'цеж', 'цез', 'цек', 'цел', 'цем', 'цен', 'цеп', 'цер', 'цес', 'цет', 'цеф', 'цех', 'цец', 'цеч', 'цеш', 'цещ', 'ци', 'циб', 'цив', 'циг', 'цид', 'циж', 'циз', 'цик', 'цил', 'цим', 'цин', 'цип', 'цир', 'цис', 'цит', 'циф', 'цих', 'циц', 'цич', 'циш', 'цищ', 'цо', 'цоб', 'цов', 'цог', 'цод', 'цож', 'цоз', 'цок', 'цол', 'цом', 'цон', 'цоп', 'цор', 'цос', 'цот', 'цоф', 'цох', 'цоц', 'цоч', 'цош', 'цощ', 'цу', 'цуб', 'цув', 'цуг', 'цуд', 'цуж', 'цуз', 'цук', 'цул', 'цум', 'цун', 'цуп', 'цур', 'цус', 'цут', 'цуф', 'цух', 'цуц', 'цуч', 'цуш', 'цущ', 'цы', 'цыб', 'цыв', 'цыг', 'цыд', 'цыж', 'цыз', 'цык', 'цыл', 'цым', 'цын', 'цып', 'цыр', 'цыс', 'цыт', 'цыф', 'цых', 'цыц', 'цыч', 'цыш', 'цыщ', 'цэ', 'цэб', 'цэв', 'цэг', 'цэд', 'цэж', 'цэз', 'цэк', 'цэл', 'цэм', 'цэн', 'цэп', 'цэр', 'цэс', 'цэт', 'цэф', 'цэх', 'цэц', 'цэч', 'цэш', 'цэщ', 'цю', 'цюб', 'цюв', 'цюг', 'цюд', 'цюж', 'цюз', 'цюк', 'цюл', 'цюм', 'цюн', 'цюп', 'цюр', 'цюс', 'цют', 'цюф', 'цюх', 'цюц', 'цюч', 'цюш', 'цющ', 'ця', 'цяб', 'цяв', 'цяг', 'цяд', 'цяж', 'цяз', 'цяк', 'цял', 'цям', 'цян', 'цяп', 'цяр', 'цяс', 'цят', 'цяф', 'цях', 'цяц', 'цяч', 'цяш', 'цящ', 'цё', 'цёб', 'цёв', 'цёг', 'цёд', 'цёж', 'цёз', 'цёк', 'цёл', 'цём', 'цён', 'цёп', 'цёр', 'цёс', 'цёт', 'цёф', 'цёх', 'цёц', 'цёч', 'цёш', 'цёщ', 
            
            'ча', 'чаб', 'чав', 'чаг', 'чад', 'чаж', 'чаз', 'чак', 'чал', 'чам', 'чан', 'чап', 'чар', 'час', 'чат', 'чаф', 'чах', 'чац', 'чач', 'чаш', 'чащ', 'че', 'чеб', 'чев', 'чег', 'чед', 'чеж', 'чез', 'чек', 'чел', 'чем', 'чен', 'чеп', 'чер', 'чес', 'чет', 'чеф', 'чех', 'чец', 'чеч', 'чеш', 'чещ', 'чи', 'чиб', 'чив', 'чиг', 'чид', 'чиж', 'чиз', 'чик', 'чил', 'чим', 'чин', 'чип', 'чир', 'чис', 'чит', 'чиф', 'чих', 'чиц', 'чич', 'чиш', 'чищ', 'чо', 'чоб', 'чов', 'чог', 'чод', 'чож', 'чоз', 'чок', 'чол', 'чом', 'чон', 'чоп', 'чор', 'чос', 'чот', 'чоф', 'чох', 'чоц', 'чоч', 'чош', 'чощ', 'чу', 'чуб', 'чув', 'чуг', 'чуд', 'чуж', 'чуз', 'чук', 'чул', 'чум', 'чун', 'чуп', 'чур', 'чус', 'чут', 'чуф', 'чух', 'чуц', 'чуч', 'чуш', 'чущ', 'чы', 'чыб', 'чыв', 'чыг', 'чыд', 'чыж', 'чыз', 'чык', 'чыл', 'чым', 'чын', 'чып', 'чыр', 'чыс', 'чыт', 'чыф', 'чых', 'чыц', 'чыч', 'чыш', 'чыщ', 'чэ', 'чэб', 'чэв', 'чэг', 'чэд', 'чэж', 'чэз', 'чэк', 'чэл', 'чэм', 'чэн', 'чэп', 'чэр', 'чэс', 'чэт', 'чэф', 'чэх', 'чэц', 'чэч', 'чэш', 'чэщ', 'чю', 'чюб', 'чюв', 'чюг', 'чюд', 'чюж', 'чюз', 'чюк', 'чюл', 'чюм', 'чюн', 'чюп', 'чюр', 'чюс', 'чют', 'чюф', 'чюх', 'чюц', 'чюч', 'чюш', 'чющ', 'чя', 'чяб', 'чяв', 'чяг', 'чяд', 'чяж', 'чяз', 'чяк', 'чял', 'чям', 'чян', 'чяп', 'чяр', 'чяс', 'чят', 'чяф', 'чях', 'чяц', 'чяч', 'чяш', 'чящ', 'чё', 'чёб', 'чёв', 'чёг', 'чёд', 'чёж', 'чёз', 'чёк', 'чёл', 'чём', 'чён', 'чёп', 'чёр', 'чёс', 'чёт', 'чёф', 'чёх', 'чёц', 'чёч', 'чёш', 'чёщ', 
            
            'ша', 'шаб', 'шав', 'шаг', 'шад', 'шаж', 'шаз', 'шак', 'шал', 'шам', 'шан', 'шап', 'шар', 'шас', 'шат', 'шаф', 'шах', 'шац', 'шач', 'шаш', 'шащ', 'ше', 'шеб', 'шев', 'шег', 'шед', 'шеж', 'шез', 'шек', 'шел', 'шем', 'шен', 'шеп', 'шер', 'шес', 'шет', 'шеф', 'шех', 'шец', 'шеч', 'шеш', 'шещ', 'ши', 'шиб', 'шив', 'шиг', 'шид', 'шиж', 'шиз', 'шик', 'шил', 'шим', 'шин', 'шип', 'шир', 'шис', 'шит', 'шиф', 'ших', 'шиц', 'шич', 'шиш', 'шищ', 'шо', 'шоб', 'шов', 'шог', 'шод', 'шож', 'шоз', 'шок', 'шол', 'шом', 'шон', 'шоп', 'шор', 'шос', 'шот', 'шоф', 'шох', 'шоц', 'шоч', 'шош', 'шощ', 'шу', 'шуб', 'шув', 'шуг', 'шуд', 'шуж', 'шуз', 'шук', 'шул', 'шум', 'шун', 'шуп', 'шур', 'шус', 'шут', 'шуф', 'шух', 'шуц', 'шуч', 'шуш', 'шущ', 'шы', 'шыб', 'шыв', 'шыг', 'шыд', 'шыж', 'шыз', 'шык', 'шыл', 'шым', 'шын', 'шып', 'шыр', 'шыс', 'шыт', 'шыф', 'шых', 'шыц', 'шыч', 'шыш', 'шыщ', 'шэ', 'шэб', 'шэв', 'шэг', 'шэд', 'шэж', 'шэз', 'шэк', 'шэл', 'шэм', 'шэн', 'шэп', 'шэр', 'шэс', 'шэт', 'шэф', 'шэх', 'шэц', 'шэч', 'шэш', 'шэщ', 'шю', 'шюб', 'шюв', 'шюг', 'шюд', 'шюж', 'шюз', 'шюк', 'шюл', 'шюм', 'шюн', 'шюп', 'шюр', 'шюс', 'шют', 'шюф', 'шюх', 'шюц', 'шюч', 'шюш', 'шющ', 'шя', 'шяб', 'шяв', 'шяг', 'шяд', 'шяж', 'шяз', 'шяк', 'шял', 'шям', 'шян', 'шяп', 'шяр', 'шяс', 'шят', 'шяф', 'шях', 'шяц', 'шяч', 'шяш', 'шящ', 'шё', 'шёб', 'шёв', 'шёг', 'шёд', 'шёж', 'шёз', 'шёк', 'шёл', 'шём', 'шён', 'шёп', 'шёр', 'шёс', 'шёт', 'шёф', 'шёх', 'шёц', 'шёч', 'шёш', 'шёщ', 
            
            'ща', 'щаб', 'щав', 'щаг', 'щад', 'щаж', 'щаз', 'щак', 'щал', 'щам', 'щан', 'щап', 'щар', 'щас', 'щат', 'щаф', 'щах', 'щац', 'щач', 'щаш', 'щащ', 'ще', 'щеб', 'щев', 'щег', 'щед', 'щеж', 'щез', 'щек', 'щел', 'щем', 'щен', 'щеп', 'щер', 'щес', 'щет', 'щеф', 'щех', 'щец', 'щеч', 'щеш', 'щещ', 'щи', 'щиб', 'щив', 'щиг', 'щид', 'щиж', 'щиз', 'щик', 'щил', 'щим', 'щин', 'щип', 'щир', 'щис', 'щит', 'щиф', 'щих', 'щиц', 'щич', 'щиш', 'щищ', 'що', 'щоб', 'щов', 'щог', 'щод', 'щож', 'щоз', 'щок', 'щол', 'щом', 'щон', 'щоп', 'щор', 'щос', 'щот', 'щоф', 'щох', 'щоц', 'щоч', 'щош', 'щощ', 'щу', 'щуб', 'щув', 'щуг', 'щуд', 'щуж', 'щуз', 'щук', 'щул', 'щум', 'щун', 'щуп', 'щур', 'щус', 'щут', 'щуф', 'щух', 'щуц', 'щуч', 'щуш', 'щущ', 'щы', 'щыб', 'щыв', 'щыг', 'щыд', 'щыж', 'щыз', 'щык', 'щыл', 'щым', 'щын', 'щып', 'щыр', 'щыс', 'щыт', 'щыф', 'щых', 'щыц', 'щыч', 'щыш', 'щыщ', 'щэ', 'щэб', 'щэв', 'щэг', 'щэд', 'щэж', 'щэз', 'щэк', 'щэл', 'щэм', 'щэн', 'щэп', 'щэр', 'щэс', 'щэт', 'щэф', 'щэх', 'щэц', 'щэч', 'щэш', 'щэщ', 'щю', 'щюб', 'щюв', 'щюг', 'щюд', 'щюж', 'щюз', 'щюк', 'щюл', 'щюм', 'щюн', 'щюп', 'щюр', 'щюс', 'щют', 'щюф', 'щюх', 'щюц', 'щюч', 'щюш', 'щющ', 'щя', 'щяб', 'щяв', 'щяг', 'щяд', 'щяж', 'щяз', 'щяк', 'щял', 'щям', 'щян', 'щяп', 'щяр', 'щяс', 'щят', 'щяф', 'щях', 'щяц', 'щяч', 'щяш', 'щящ', 'щё', 'щёб', 'щёв', 'щёг', 'щёд', 'щёж', 'щёз', 'щёк', 'щёл', 'щём', 'щён', 'щёп', 'щёр', 'щёс', 'щёт', 'щёф', 'щёх', 'щёц', 'щёч', 'щёш', 'щёщ', 
            
            'ыб', 'ыв', 'ыг', 'ыд', 'ыж', 'ыз', 'ык', 'ыл', 'ым', 'ын', 'ып', 'ыр', 'ыс', 'ыт', 'ыф', 'ых', 'ыц', 'ыч', 'ыш', 'ыщ', 
            
            'эб', 'эв', 'эг', 'эд', 'эж', 'эз', 'эк', 'эл', 'эм', 'эн', 'эп', 'эр', 'эс', 'эт', 'эф', 'эх', 'эц', 'эч', 'эш', 'эщ', 
            
            'юб', 'юв', 'юг', 'юд', 'юж', 'юз', 'юк', 'юл', 'юм', 'юн', 'юп', 'юр', 'юс', 'ют', 'юф', 'юх', 'юц', 'юч', 'юш', 'ющ', 
            
            'яб', 'яв', 'яг', 'яд', 'яж', 'яз', 'як', 'ял', 'ям', 'ян', 'яп', 'яр', 'яс', 'ят', 'яф', 'ях', 'яц', 'яч', 'яш', 'ящ', 
            
            'ёб', 'ёв', 'ёг', 'ёд', 'ёж', 'ёз', 'ёк', 'ёл', 'ём', 'ён', 'ёп', 'ёр', 'ёс', 'ёт', 'ёф', 'ёх', 'ёц', 'ёч', 'ёш', 'ёщ',

            # Русские слоги и слова с заглавной буквы

            'Аг', 'Ад', 'Аз', 'Аи', 'Ал', 'Ам', 'Ан', 'Ап', 'Ар', 'Ас', 'Ат', 'Ах', 'Ац', 'Ач', 'Аш', 'Ащ', 'Аю', 'Ав', 'Аф', 'Ага',

            'Ба', 'Бо', 'Бу', 'Бе', 'Би', 'Бл', 'Бр', 'Бо', 'Би', 'Бл', 'Бр', 'Бывает', 'Был', 'Буду', 'Будто',

            'Ве', 'Ви', 'Во', 'Ву', 'Вы', 'Вя', 'Ви', 'Ве', 'Вл', 'Вр', 'Вот',

            'Га', 'Го', 'Гу', 'Ге', 'Ги', 'Гл', 'Гр', 'Где',

            'Да', 'До', 'Ду', 'Де', 'Ди', 'Дл', 'Др', 'Для', 'Дай',

            'Ек', 'Ел', 'Ен', 'Ес', 'Ет', 'Ер', 'Если', 'Есть', 'Ещё', 'Её',

            'Ёл', 'Ёж',

            'Же', 'Жи', 'Жо', 'Жу', 'Жы', 'Жа', 'Ждёте', 'Ждать', 'Живёте', 'Жив', 'Желаешь', 'Желаете', 'Ждём',

            'За', 'Зд', 'Зе', 'Зи', 'Зо', 'Зу', 'Зы', 'Зачем',

            'Иж', 'Ит', 'Из', 'Ии', 'Иш', 'Из', 'Из-за', 'Извините',

            'Ка', 'Ко', 'Ку', 'Ке', 'Ки', 'Кл', 'Кр', 'Кто', 'Кого', 'Кому', 'Как', 'Кто-то', 'Какие-то', 'Кого-то',

            'Ла', 'Ло', 'Лу', 'Ле', 'Ли', 'Лл', 'Лр', 'Легко', 'Легально', 'Лично', 'Логично', 'Лучше',

            'Ма', 'Мо', 'Му', 'Ме', 'Ми', 'Мл', 'Мр', 'Мы',

            'На', 'Но', 'Ну', 'Не', 'Ни', 'Нл', 'Нр', 'Нет', 'Нужно',

            'Ок', 'Ол', 'Он', 'Ом', 'Ок', 'Ор', 'Ос', 'Откуда', 'От',

            'Па', 'По', 'Пу', 'Пе', 'Пи', 'Пл', 'Пр', 'Почему', 'Почему-то',

            'Ра', 'Ро', 'Ру', 'Ре', 'Ри', 'Раз',

            'Са', 'Со', 'Су', 'Се', 'Си', 'Сл', 'Ср',  'Сколько', 'Сейчас',

            'Та', 'То', 'Ту', 'Те', 'Ти', 'Тл', 'Тр', 'Только', 'Так', 'Ты',

            'Ум', 'Уп', 'Ус', 'Ут', 'Ую',

            'Фа', 'Фо', 'Фу', 'Фе', 'Фи',

            'Ха', 'Хо', 'Ху', 'Хе', 'Хи', 'Хочешь', 'Хочу', 'Хотел',

            'Ца', 'Це', 'Ци', 'Цо', 'Цу',

            'Ча', 'Чо', 'Чу', 'Че', 'Чи', 'Что', 'Что-то', 'Чему',

            'Ша', 'Шо', 'Шу', 'Ше', 'Ши',

            'Ща', 'Що', 'Щу', 'Ще', 'Щи',

            'Эт', 'Эр', 'Эс', 'Это', 'Эта', 'Эти', 'Этому'

            'Ют', 'Юн', 'Юж',

            'Яв', 'Яг', 'Яд', 'Яз', 'Яи', 'Ял', 'Ям', 'Ян', 'Яр',

            # Английские слоги
            
            'ab', 'ac', 'ad', 'af', 'ag', 'ah', 'aj', 'ak', 'al', 'am', 'an', 'ap', 'aq', 'ar', 'as', 'at', 'av', 'aw', 'ax', 'ay', 'az', 
            
            'ba', 'bab', 'bac', 'bad', 'baf', 'bag', 'bah', 'baj', 'bak', 'bal', 'bam', 'ban', 'bap', 'baq', 'bar', 'bas', 'bat', 'bav', 'baw', 'bax', 'bay', 'baz', 'be', 'beb', 'bec', 'bed', 'bef', 'beg', 'beh', 'bej', 'bek', 'bel', 'bem', 'ben', 'bep', 'beq', 'ber', 'bes', 'bet', 'bev', 'bew', 'bex', 'bey', 'bez', 'bi', 'bib', 'bic', 'bid', 'bif', 'big', 'bih', 'bij', 'bik', 'bil', 'bim', 'bin', 'bip', 'biq', 'bir', 'bis', 'bit', 'biv', 'biw', 'bix', 'biy', 'biz', 'bo', 'bob', 'boc', 'bod', 'bof', 'bog', 'boh', 'boj', 'bok', 'bol', 'bom', 'bon', 'bop', 'boq', 'bor', 'bos', 'bot', 'bov', 'bow', 'box', 'boy', 'boz', 'bu', 'bub', 'buc', 'bud', 'buf', 'bug', 'buh', 'buj', 'buk', 'bul', 'bum', 'bun', 'bup', 'buq', 'bur', 'bus', 'but', 'buv', 'buw', 'bux', 'buy', 'buz', 'by', 'byb', 'byc', 'byd', 'byf', 'byg', 'byh', 'byj', 'byk', 'byl', 'bym', 'byn', 'byp', 'byq', 'byr', 'bys', 'byt', 'byv', 'byw', 'byx', 'byy', 'byz', 
            
            'ca', 'cab', 'cac', 'cad', 'caf', 'cag', 'cah', 'caj', 'cak', 'cal', 'cam', 'can', 'cap', 'caq', 'car', 'cas', 'cat', 'cav', 'caw', 'cax', 'cay', 'caz', 'ce', 'ceb', 'cec', 'ced', 'cef', 'ceg', 'ceh', 'cej', 'cek', 'cel', 'cem', 'cen', 'cep', 'ceq', 'cer', 'ces', 'cet', 'cev', 'cew', 'cex', 'cey', 'cez', 'ci', 'cib', 'cic', 'cid', 'cif', 'cig', 'cih', 'cij', 'cik', 'cil', 'cim', 'cin', 'cip', 'ciq', 'cir', 'cis', 'cit', 'civ', 'ciw', 'cix', 'ciy', 'ciz', 'co', 'cob', 'coc', 'cod', 'cof', 'cog', 'coh', 'coj', 'cok', 'col', 'com', 'con', 'cop', 'coq', 'cor', 'cos', 'cot', 'cov', 'cow', 'cox', 'coy', 'coz', 'cu', 'cub', 'cuc', 'cud', 'cuf', 'cug', 'cuh', 'cuj', 'cuk', 'cul', 'cum', 'cun', 'cup', 'cuq', 'cur', 'cus', 'cut', 'cuv', 'cuw', 'cux', 'cuy', 'cuz', 'cy', 'cyb', 'cyc', 'cyd', 'cyf', 'cyg', 'cyh', 'cyj', 'cyk', 'cyl', 'cym', 'cyn', 'cyp', 'cyq', 'cyr', 'cys', 'cyt', 'cyv', 'cyw', 'cyx', 'cyy', 'cyz', 
            
            'da', 'dab', 'dac', 'dad', 'daf', 'dag', 'dah', 'daj', 'dak', 'dal', 'dam', 'dan', 'dap', 'daq', 'dar', 'das', 'dat', 'dav', 'daw', 'dax', 'day', 'daz', 'de', 'deb', 'dec', 'ded', 'def', 'deg', 'deh', 'dej', 'dek', 'del', 'dem', 'den', 'dep', 'deq', 'der', 'des', 'det', 'dev', 'dew', 'dex', 'dey', 'dez', 'di', 'dib', 'dic', 'did', 'dif', 'dig', 'dih', 'dij', 'dik', 'dil', 'dim', 'din', 'dip', 'diq', 'dir', 'dis', 'dit', 'div', 'diw', 'dix', 'diy', 'diz', 'do', 'dob', 'doc', 'dod', 'dof', 'dog', 'doh', 'doj', 'dok', 'dol', 'dom', 'don', 'dop', 'doq', 'dor', 'dos', 'dot', 'dov', 'dow', 'dox', 'doy', 'doz', 'du', 'dub', 'duc', 'dud', 'duf', 'dug', 'duh', 'duj', 'duk', 'dul', 'dum', 'dun', 'dup', 'duq', 'dur', 'dus', 'dut', 'duv', 'duw', 'dux', 'duy', 'duz', 'dy', 'dyb', 'dyc', 'dyd', 'dyf', 'dyg', 'dyh', 'dyj', 'dyk', 'dyl', 'dym', 'dyn', 'dyp', 'dyq', 'dyr', 'dys', 'dyt', 'dyv', 'dyw', 'dyx', 'dyy', 'dyz', 
            
            'eb', 'ec', 'ed', 'ef', 'eg', 'eh', 'ej', 'ek', 'el', 'em', 'en', 'ep', 'eq', 'er', 'es', 'et', 'ev', 'ew', 'ex', 'ey', 'ez', 
            
            'fa', 'fab', 'fac', 'fad', 'faf', 'fag', 'fah', 'faj', 'fak', 'fal', 'fam', 'fan', 'fap', 'faq', 'far', 'fas', 'fat', 'fav', 'faw', 'fax', 'fay', 'faz', 'fe', 'feb', 'fec', 'fed', 'fef', 'feg', 'feh', 'fej', 'fek', 'fel', 'fem', 'fen', 'fep', 'feq', 'fer', 'fes', 'fet', 'fev', 'few', 'fex', 'fey', 'fez', 'fi', 'fib', 'fic', 'fid', 'fif', 'fig', 'fih', 'fij', 'fik', 'fil', 'fim', 'fin', 'fip', 'fiq', 'fir', 'fis', 'fit', 'fiv', 'fiw', 'fix', 'fiy', 'fiz', 'fo', 'fob', 'foc', 'fod', 'fof', 'fog', 'foh', 'foj', 'fok', 'fol', 'fom', 'fon', 'fop', 'foq', 'for', 'fos', 'fot', 'fov', 'fow', 'fox', 'foy', 'foz', 'fu', 'fub', 'fuc', 'fud', 'fuf', 'fug', 'fuh', 'fuj', 'fuk', 'ful', 'fum', 'fun', 'fup', 'fuq', 'fur', 'fus', 'fut', 'fuv', 'fuw', 'fux', 'fuy', 'fuz', 'fy', 'fyb', 'fyc', 'fyd', 'fyf', 'fyg', 'fyh', 'fyj', 'fyk', 'fyl', 'fym', 'fyn', 'fyp', 'fyq', 'fyr', 'fys', 'fyt', 'fyv', 'fyw', 'fyx', 'fyy', 'fyz', 
            
            'ga', 'gab', 'gac', 'gad', 'gaf', 'gag', 'gah', 'gaj', 'gak', 'gal', 'gam', 'gan', 'gap', 'gaq', 'gar', 'gas', 'gat', 'gav', 'gaw', 'gax', 'gay', 'gaz', 'ge', 'geb', 'gec', 'ged', 'gef', 'geg', 'geh', 'gej', 'gek', 'gel', 'gem', 'gen', 'gep', 'geq', 'ger', 'ges', 'get', 'gev', 'gew', 'gex', 'gey', 'gez', 'gi', 'gib', 'gic', 'gid', 'gif', 'gig', 'gih', 'gij', 'gik', 'gil', 'gim', 'gin', 'gip', 'giq', 'gir', 'gis', 'git', 'giv', 'giw', 'gix', 'giy', 'giz', 'go', 'gob', 'goc', 'god', 'gof', 'gog', 'goh', 'goj', 'gok', 'gol', 'gom', 'gon', 'gop', 'goq', 'gor', 'gos', 'got', 'gov', 'gow', 'gox', 'goy', 'goz', 'gu', 'gub', 'guc', 'gud', 'guf', 'gug', 'guh', 'guj', 'guk', 'gul', 'gum', 'gun', 'gup', 'guq', 'gur', 'gus', 'gut', 'guv', 'guw', 'gux', 'guy', 'guz', 'gy', 'gyb', 'gyc', 'gyd', 'gyf', 'gyg', 'gyh', 'gyj', 'gyk', 'gyl', 'gym', 'gyn', 'gyp', 'gyq', 'gyr', 'gys', 'gyt', 'gyv', 'gyw', 'gyx', 'gyy', 'gyz', 
            
            'ha', 'hab', 'hac', 'had', 'haf', 'hag', 'hah', 'haj', 'hak', 'hal', 'ham', 'han', 'hap', 'haq', 'har', 'has', 'hat', 'hav', 'haw', 'hax', 'hay', 'haz', 'he', 'heb', 'hec', 'hed', 'hef', 'heg', 'heh', 'hej', 'hek', 'hel', 'hem', 'hen', 'hep', 'heq', 'her', 'hes', 'het', 'hev', 'hew', 'hex', 'hey', 'hez', 'hi', 'hib', 'hic', 'hid', 'hif', 'hig', 'hih', 'hij', 'hik', 'hil', 'him', 'hin', 'hip', 'hiq', 'hir', 'his', 'hit', 'hiv', 'hiw', 'hix', 'hiy', 'hiz', 'ho', 'hob', 'hoc', 'hod', 'hof', 'hog', 'hoh', 'hoj', 'hok', 'hol', 'hom', 'hon', 'hop', 'hoq', 'hor', 'hos', 'hot', 'hov', 'how', 'hox', 'hoy', 'hoz', 'hu', 'hub', 'huc', 'hud', 'huf', 'hug', 'huh', 'huj', 'huk', 'hul', 'hum', 'hun', 'hup', 'huq', 'hur', 'hus', 'hut', 'huv', 'huw', 'hux', 'huy', 'huz', 'hy', 'hyb', 'hyc', 'hyd', 'hyf', 'hyg', 'hyh', 'hyj', 'hyk', 'hyl', 'hym', 'hyn', 'hyp', 'hyq', 'hyr', 'hys', 'hyt', 'hyv', 'hyw', 'hyx', 'hyy', 'hyz', 
            
            'ib', 'ic', 'id', 'if', 'ig', 'ih', 'ij', 'ik', 'il', 'im', 'in', 'ip', 'iq', 'ir', 'is', 'it', 'iv', 'iw', 'ix', 'iy', 'iz', 
            
            'ja', 'jab', 'jac', 'jad', 'jaf', 'jag', 'jah', 'jaj', 'jak', 'jal', 'jam', 'jan', 'jap', 'jaq', 'jar', 'jas', 'jat', 'jav', 'jaw', 'jax', 'jay', 'jaz', 'je', 'jeb', 'jec', 'jed', 'jef', 'jeg', 'jeh', 'jej', 'jek', 'jel', 'jem', 'jen', 'jep', 'jeq', 'jer', 'jes', 'jet', 'jev', 'jew', 'jex', 'jey', 'jez', 'ji', 'jib', 'jic', 'jid', 'jif', 'jig', 'jih', 'jij', 'jik', 'jil', 'jim', 'jin', 'jip', 'jiq', 'jir', 'jis', 'jit', 'jiv', 'jiw', 'jix', 'jiy', 'jiz', 'jo', 'job', 'joc', 'jod', 'jof', 'jog', 'joh', 'joj', 'jok', 'jol', 'jom', 'jon', 'jop', 'joq', 'jor', 'jos', 'jot', 'jov', 'jow', 'jox', 'joy', 'joz', 'ju', 'jub', 'juc', 'jud', 'juf', 'jug', 'juh', 'juj', 'juk', 'jul', 'jum', 'jun', 'jup', 'juq', 'jur', 'jus', 'jut', 'juv', 'juw', 'jux', 'juy', 'juz', 'jy', 'jyb', 'jyc', 'jyd', 'jyf', 'jyg', 'jyh', 'jyj', 'jyk', 'jyl', 'jym', 'jyn', 'jyp', 'jyq', 'jyr', 'jys', 'jyt', 'jyv', 'jyw', 'jyx', 'jyy', 'jyz', 
            
            'ka', 'kab', 'kac', 'kad', 'kaf', 'kag', 'kah', 'kaj', 'kak', 'kal', 'kam', 'kan', 'kap', 'kaq', 'kar', 'kas', 'kat', 'kav', 'kaw', 'kax', 'kay', 'kaz', 'ke', 'keb', 'kec', 'ked', 'kef', 'keg', 'keh', 'kej', 'kek', 'kel', 'kem', 'ken', 'kep', 'keq', 'ker', 'kes', 'ket', 'kev', 'kew', 'kex', 'key', 'kez', 'ki', 'kib', 'kic', 'kid', 'kif', 'kig', 'kih', 'kij', 'kik', 'kil', 'kim', 'kin', 'kip', 'kiq', 'kir', 'kis', 'kit', 'kiv', 'kiw', 'kix', 'kiy', 'kiz', 'ko', 'kob', 'koc', 'kod', 'kof', 'kog', 'koh', 'koj', 'kok', 'kol', 'kom', 'kon', 'kop', 'koq', 'kor', 'kos', 'kot', 'kov', 'kow', 'kox', 'koy', 'koz', 'ku', 'kub', 'kuc', 'kud', 'kuf', 'kug', 'kuh', 'kuj', 'kuk', 'kul', 'kum', 'kun', 'kup', 'kuq', 'kur', 'kus', 'kut', 'kuv', 'kuw', 'kux', 'kuy', 'kuz', 'ky', 'kyb', 'kyc', 'kyd', 'kyf', 'kyg', 'kyh', 'kyj', 'kyk', 'kyl', 'kym', 'kyn', 'kyp', 'kyq', 'kyr', 'kys', 'kyt', 'kyv', 'kyw', 'kyx', 'kyy', 'kyz', 
            
            'la', 'lab', 'lac', 'lad', 'laf', 'lag', 'lah', 'laj', 'lak', 'lal', 'lam', 'lan', 'lap', 'laq', 'lar', 'las', 'lat', 'lav', 'law', 'lax', 'lay', 'laz', 'le', 'leb', 'lec', 'led', 'lef', 'leg', 'leh', 'lej', 'lek', 'lel', 'lem', 'len', 'lep', 'leq', 'ler', 'les', 'let', 'lev', 'lew', 'lex', 'ley', 'lez', 'li', 'lib', 'lic', 'lid', 'lif', 'lig', 'lih', 'lij', 'lik', 'lil', 'lim', 'lin', 'lip', 'liq', 'lir', 'lis', 'lit', 'liv', 'liw', 'lix', 'liy', 'liz', 'lo', 'lob', 'loc', 'lod', 'lof', 'log', 'loh', 'loj', 'lok', 'lol', 'lom', 'lon', 'lop', 'loq', 'lor', 'los', 'lot', 'lov', 'low', 'lox', 'loy', 'loz', 'lu', 'lub', 'luc', 'lud', 'luf', 'lug', 'luh', 'luj', 'luk', 'lul', 'lum', 'lun', 'lup', 'luq', 'lur', 'lus', 'lut', 'luv', 'luw', 'lux', 'luy', 'luz', 'ly', 'lyb', 'lyc', 'lyd', 'lyf', 'lyg', 'lyh', 'lyj', 'lyk', 'lyl', 'lym', 'lyn', 'lyp', 'lyq', 'lyr', 'lys', 'lyt', 'lyv', 'lyw', 'lyx', 'lyy', 'lyz', 
            
            'ma', 'mab', 'mac', 'mad', 'maf', 'mag', 'mah', 'maj', 'mak', 'mal', 'mam', 'man', 'map', 'maq', 'mar', 'mas', 'mat', 'mav', 'maw', 'max', 'may', 'maz', 'me', 'meb', 'mec', 'med', 'mef', 'meg', 'meh', 'mej', 'mek', 'mel', 'mem', 'men', 'mep', 'meq', 'mer', 'mes', 'met', 'mev', 'mew', 'mex', 'mey', 'mez', 'mi', 'mib', 'mic', 'mid', 'mif', 'mig', 'mih', 'mij', 'mik', 'mil', 'mim', 'min', 'mip', 'miq', 'mir', 'mis', 'mit', 'miv', 'miw', 'mix', 'miy', 'miz', 'mo', 'mob', 'moc', 'mod', 'mof', 'mog', 'moh', 'moj', 'mok', 'mol', 'mom', 'mon', 'mop', 'moq', 'mor', 'mos', 'mot', 'mov', 'mow', 'mox', 'moy', 'moz', 'mu', 'mub', 'muc', 'mud', 'muf', 'mug', 'muh', 'muj', 'muk', 'mul', 'mum', 'mun', 'mup', 'muq', 'mur', 'mus', 'mut', 'muv', 'muw', 'mux', 'muy', 'muz', 'my', 'myb', 'myc', 'myd', 'myf', 'myg', 'myh', 'myj', 'myk', 'myl', 'mym', 'myn', 'myp', 'myq', 'myr', 'mys', 'myt', 'myv', 'myw', 'myx', 'myy', 'myz', 
            
            'na', 'nab', 'nac', 'nad', 'naf', 'nag', 'nah', 'naj', 'nak', 'nal', 'nam', 'nan', 'nap', 'naq', 'nar', 'nas', 'nat', 'nav', 'naw', 'nax', 'nay', 'naz', 'ne', 'neb', 'nec', 'ned', 'nef', 'neg', 'neh', 'nej', 'nek', 'nel', 'nem', 'nen', 'nep', 'neq', 'ner', 'nes', 'net', 'nev', 'new', 'nex', 'ney', 'nez', 'ni', 'nib', 'nic', 'nid', 'nif', 'nig', 'nih', 'nij', 'nik', 'nil', 'nim', 'nin', 'nip', 'niq', 'nir', 'nis', 'nit', 'niv', 'niw', 'nix', 'niy', 'niz', 'no', 'nob', 'noc', 'nod', 'nof', 'nog', 'noh', 'noj', 'nok', 'nol', 'nom', 'non', 'nop', 'noq', 'nor', 'nos', 'not', 'nov', 'now', 'nox', 'noy', 'noz', 'nu', 'nub', 'nuc', 'nud', 'nuf', 'nug', 'nuh', 'nuj', 'nuk', 'nul', 'num', 'nun', 'nup', 'nuq', 'nur', 'nus', 'nut', 'nuv', 'nuw', 'nux', 'nuy', 'nuz', 'ny', 'nyb', 'nyc', 'nyd', 'nyf', 'nyg', 'nyh', 'nyj', 'nyk', 'nyl', 'nym', 'nyn', 'nyp', 'nyq', 'nyr', 'nys', 'nyt', 'nyv', 'nyw', 'nyx', 'nyy', 'nyz', 
            
            'ob', 'oc', 'od', 'of', 'og', 'oh', 'oj', 'ok', 'ol', 'om', 'on', 'op', 'oq', 'or', 'os', 'ot', 'ov', 'ow', 'ox', 'oy', 'oz', 
            
            'pa', 'pab', 'pac', 'pad', 'paf', 'pag', 'pah', 'paj', 'pak', 'pal', 'pam', 'pan', 'pap', 'paq', 'par', 'pas', 'pat', 'pav', 'paw', 'pax', 'pay', 'paz', 'pe', 'peb', 'pec', 'ped', 'pef', 'peg', 'peh', 'pej', 'pek', 'pel', 'pem', 'pen', 'pep', 'peq', 'per', 'pes', 'pet', 'pev', 'pew', 'pex', 'pey', 'pez', 'pi', 'pib', 'pic', 'pid', 'pif', 'pig', 'pih', 'pij', 'pik', 'pil', 'pim', 'pin', 'pip', 'piq', 'pir', 'pis', 'pit', 'piv', 'piw', 'pix', 'piy', 'piz', 'po', 'pob', 'poc', 'pod', 'pof', 'pog', 'poh', 'poj', 'pok', 'pol', 'pom', 'pon', 'pop', 'poq', 'por', 'pos', 'pot', 'pov', 'pow', 'pox', 'poy', 'poz', 'pu', 'pub', 'puc', 'pud', 'puf', 'pug', 'puh', 'puj', 'puk', 'pul', 'pum', 'pun', 'pup', 'puq', 'pur', 'pus', 'put', 'puv', 'puw', 'pux', 'puy', 'puz', 'py', 'pyb', 'pyc', 'pyd', 'pyf', 'pyg', 'pyh', 'pyj', 'pyk', 'pyl', 'pym', 'pyn', 'pyp', 'pyq', 'pyr', 'pys', 'pyt', 'pyv', 'pyw', 'pyx', 'pyy', 'pyz', 
            
            'qa', 'qab', 'qac', 'qad', 'qaf', 'qag', 'qah', 'qaj', 'qak', 'qal', 'qam', 'qan', 'qap', 'qaq', 'qar', 'qas', 'qat', 'qav', 'qaw', 'qax', 'qay', 'qaz', 'qe', 'qeb', 'qec', 'qed', 'qef', 'qeg', 'qeh', 'qej', 'qek', 'qel', 'qem', 'qen', 'qep', 'qeq', 'qer', 'qes', 'qet', 'qev', 'qew', 'qex', 'qey', 'qez', 'qi', 'qib', 'qic', 'qid', 'qif', 'qig', 'qih', 'qij', 'qik', 'qil', 'qim', 'qin', 'qip', 'qiq', 'qir', 'qis', 'qit', 'qiv', 'qiw', 'qix', 'qiy', 'qiz', 'qo', 'qob', 'qoc', 'qod', 'qof', 'qog', 'qoh', 'qoj', 'qok', 'qol', 'qom', 'qon', 'qop', 'qoq', 'qor', 'qos', 'qot', 'qov', 'qow', 'qox', 'qoy', 'qoz', 'qu', 'qub', 'quc', 'qud', 'quf', 'qug', 'quh', 'quj', 'quk', 'qul', 'qum', 'qun', 'qup', 'quq', 'qur', 'qus', 'qut', 'quv', 'quw', 'qux', 'quy', 'quz', 'qy', 'qyb', 'qyc', 'qyd', 'qyf', 'qyg', 'qyh', 'qyj', 'qyk', 'qyl', 'qym', 'qyn', 'qyp', 'qyq', 'qyr', 'qys', 'qyt', 'qyv', 'qyw', 'qyx', 'qyy', 'qyz', 
            
            'ra', 'rab', 'rac', 'rad', 'raf', 'rag', 'rah', 'raj', 'rak', 'ral', 'ram', 'ran', 'rap', 'raq', 'rar', 'ras', 'rat', 'rav', 'raw', 'rax', 'ray', 'raz', 're', 'reb', 'rec', 'red', 'ref', 'reg', 'reh', 'rej', 'rek', 'rel', 'rem', 'ren', 'rep', 'req', 'rer', 'res', 'ret', 'rev', 'rew', 'rex', 'rey', 'rez', 'ri', 'rib', 'ric', 'rid', 'rif', 'rig', 'rih', 'rij', 'rik', 'ril', 'rim', 'rin', 'rip', 'riq', 'rir', 'ris', 'rit', 'riv', 'riw', 'rix', 'riy', 'riz', 'ro', 'rob', 'roc', 'rod', 'rof', 'rog', 'roh', 'roj', 'rok', 'rol', 'rom', 'ron', 'rop', 'roq', 'ror', 'ros', 'rot', 'rov', 'row', 'rox', 'roy', 'roz', 'ru', 'rub', 'ruc', 'rud', 'ruf', 'rug', 'ruh', 'ruj', 'ruk', 'rul', 'rum', 'run', 'rup', 'ruq', 'rur', 'rus', 'rut', 'ruv', 'ruw', 'rux', 'ruy', 'ruz', 'ry', 'ryb', 'ryc', 'ryd', 'ryf', 'ryg', 'ryh', 'ryj', 'ryk', 'ryl', 'rym', 'ryn', 'ryp', 'ryq', 'ryr', 'rys', 'ryt', 'ryv', 'ryw', 'ryx', 'ryy', 'ryz', 
            
            'sa', 'sab', 'sac', 'sad', 'saf', 'sag', 'sah', 'saj', 'sak', 'sal', 'sam', 'san', 'sap', 'saq', 'sar', 'sas', 'sat', 'sav', 'saw', 'sax', 'say', 'saz', 'se', 'seb', 'sec', 'sed', 'sef', 'seg', 'seh', 'sej', 'sek', 'sel', 'sem', 'sen', 'sep', 'seq', 'ser', 'ses', 'set', 'sev', 'sew', 'sex', 'sey', 'sez', 'si', 'sib', 'sic', 'sid', 'sif', 'sig', 'sih', 'sij', 'sik', 'sil', 'sim', 'sin', 'sip', 'siq', 'sir', 'sis', 'sit', 'siv', 'siw', 'six', 'siy', 'siz', 'so', 'sob', 'soc', 'sod', 'sof', 'sog', 'soh', 'soj', 'sok', 'sol', 'som', 'son', 'sop', 'soq', 'sor', 'sos', 'sot', 'sov', 'sow', 'sox', 'soy', 'soz', 'su', 'sub', 'suc', 'sud', 'suf', 'sug', 'suh', 'suj', 'suk', 'sul', 'sum', 'sun', 'sup', 'suq', 'sur', 'sus', 'sut', 'suv', 'suw', 'sux', 'suy', 'suz', 'sy', 'syb', 'syc', 'syd', 'syf', 'syg', 'syh', 'syj', 'syk', 'syl', 'sym', 'syn', 'syp', 'syq', 'syr', 'sys', 'syt', 'syv', 'syw', 'syx', 'syy', 'syz', 
            
            'ta', 'tab', 'tac', 'tad', 'taf', 'tag', 'tah', 'taj', 'tak', 'tal', 'tam', 'tan', 'tap', 'taq', 'tar', 'tas', 'tat', 'tav', 'taw', 'tax', 'tay', 'taz', 'te', 'teb', 'tec', 'ted', 'tef', 'teg', 'teh', 'tej', 'tek', 'tel', 'tem', 'ten', 'tep', 'teq', 'ter', 'tes', 'tet', 'tev', 'tew', 'tex', 'tey', 'tez', 'ti', 'tib', 'tic', 'tid', 'tif', 'tig', 'tih', 'tij', 'tik', 'til', 'tim', 'tin', 'tip', 'tiq', 'tir', 'tis', 'tit', 'tiv', 'tiw', 'tix', 'tiy', 'tiz', 'to', 'tob', 'toc', 'tod', 'tof', 'tog', 'toh', 'toj', 'tok', 'tol', 'tom', 'ton', 'top', 'toq', 'tor', 'tos', 'tot', 'tov', 'tow', 'tox', 'toy', 'toz', 'tu', 'tub', 'tuc', 'tud', 'tuf', 'tug', 'tuh', 'tuj', 'tuk', 'tul', 'tum', 'tun', 'tup', 'tuq', 'tur', 'tus', 'tut', 'tuv', 'tuw', 'tux', 'tuy', 'tuz', 'ty', 'tyb', 'tyc', 'tyd', 'tyf', 'tyg', 'tyh', 'tyj', 'tyk', 'tyl', 'tym', 'tyn', 'typ', 'tyq', 'tyr', 'tys', 'tyt', 'tyv', 'tyw', 'tyx', 'tyy', 'tyz', 
            
            'ub', 'uc', 'ud', 'uf', 'ug', 'uh', 'uj', 'uk', 'ul', 'um', 'un', 'up', 'uq', 'ur', 'us', 'ut', 'uv', 'uw', 'ux', 'uy', 'uz', 
            
            'va', 'vab', 'vac', 'vad', 'vaf', 'vag', 'vah', 'vaj', 'vak', 'val', 'vam', 'van', 'vap', 'vaq', 'var', 'vas', 'vat', 'vav', 'vaw', 'vax', 'vay', 'vaz', 've', 'veb', 'vec', 'ved', 'vef', 'veg', 'veh', 'vej', 'vek', 'vel', 'vem', 'ven', 'vep', 'veq', 'ver', 'ves', 'vet', 'vev', 'vew', 'vex', 'vey', 'vez', 'vi', 'vib', 'vic', 'vid', 'vif', 'vig', 'vih', 'vij', 'vik', 'vil', 'vim', 'vin', 'vip', 'viq', 'vir', 'vis', 'vit', 'viv', 'viw', 'vix', 'viy', 'viz', 'vo', 'vob', 'voc', 'vod', 'vof', 'vog', 'voh', 'voj', 'vok', 'vol', 'vom', 'von', 'vop', 'voq', 'vor', 'vos', 'vot', 'vov', 'vow', 'vox', 'voy', 'voz', 'vu', 'vub', 'vuc', 'vud', 'vuf', 'vug', 'vuh', 'vuj', 'vuk', 'vul', 'vum', 'vun', 'vup', 'vuq', 'vur', 'vus', 'vut', 'vuv', 'vuw', 'vux', 'vuy', 'vuz', 'vy', 'vyb', 'vyc', 'vyd', 'vyf', 'vyg', 'vyh', 'vyj', 'vyk', 'vyl', 'vym', 'vyn', 'vyp', 'vyq', 'vyr', 'vys', 'vyt', 'vyv', 'vyw', 'vyx', 'vyy', 'vyz', 
            
            'wa', 'wab', 'wac', 'wad', 'waf', 'wag', 'wah', 'waj', 'wak', 'wal', 'wam', 'wan', 'wap', 'waq', 'war', 'was', 'wat', 'wav', 'waw', 'wax', 'way', 'waz', 'we', 'web', 'wec', 'wed', 'wef', 'weg', 'weh', 'wej', 'wek', 'wel', 'wem', 'wen', 'wep', 'weq', 'wer', 'wes', 'wet', 'wev', 'wew', 'wex', 'wey', 'wez', 'wi', 'wib', 'wic', 'wid', 'wif', 'wig', 'wih', 'wij', 'wik', 'wil', 'wim', 'win', 'wip', 'wiq', 'wir', 'wis', 'wit', 'wiv', 'wiw', 'wix', 'wiy', 'wiz', 'wo', 'wob', 'woc', 'wod', 'wof', 'wog', 'woh', 'woj', 'wok', 'wol', 'wom', 'won', 'wop', 'woq', 'wor', 'wos', 'wot', 'wov', 'wow', 'wox', 'woy', 'woz', 'wu', 'wub', 'wuc', 'wud', 'wuf', 'wug', 'wuh', 'wuj', 'wuk', 'wul', 'wum', 'wun', 'wup', 'wuq', 'wur', 'wus', 'wut', 'wuv', 'wuw', 'wux', 'wuy', 'wuz', 'wy', 'wyb', 'wyc', 'wyd', 'wyf', 'wyg', 'wyh', 'wyj', 'wyk', 'wyl', 'wym', 'wyn', 'wyp', 'wyq', 'wyr', 'wys', 'wyt', 'wyv', 'wyw', 'wyx', 'wyy', 'wyz', 
            
            'xa', 'xab', 'xac', 'xad', 'xaf', 'xag', 'xah', 'xaj', 'xak', 'xal', 'xam', 'xan', 'xap', 'xaq', 'xar', 'xas', 'xat', 'xav', 'xaw', 'xax', 'xay', 'xaz', 'xe', 'xeb', 'xec', 'xed', 'xef', 'xeg', 'xeh', 'xej', 'xek', 'xel', 'xem', 'xen', 'xep', 'xeq', 'xer', 'xes', 'xet', 'xev', 'xew', 'xex', 'xey', 'xez', 'xi', 'xib', 'xic', 'xid', 'xif', 'xig', 'xih', 'xij', 'xik', 'xil', 'xim', 'xin', 'xip', 'xiq', 'xir', 'xis', 'xit', 'xiv', 'xiw', 'xix', 'xiy', 'xiz', 'xo', 'xob', 'xoc', 'xod', 'xof', 'xog', 'xoh', 'xoj', 'xok', 'xol', 'xom', 'xon', 'xop', 'xoq', 'xor', 'xos', 'xot', 'xov', 'xow', 'xox', 'xoy', 'xoz', 'xu', 'xub', 'xuc', 'xud', 'xuf', 'xug', 'xuh', 'xuj', 'xuk', 'xul', 'xum', 'xun', 'xup', 'xuq', 'xur', 'xus', 'xut', 'xuv', 'xuw', 'xux', 'xuy', 'xuz', 'xy', 'xyb', 'xyc', 'xyd', 'xyf', 'xyg', 'xyh', 'xyj', 'xyk', 'xyl', 'xym', 'xyn', 'xyp', 'xyq', 'xyr', 'xys', 'xyt', 'xyv', 'xyw', 'xyx', 'xyy', 'xyz', 
            
            'ya', 'yab', 'yac', 'yad', 'yaf', 'yag', 'yah', 'yaj', 'yak', 'yal', 'yam', 'yan', 'yap', 'yaq', 'yar', 'yas', 'yat', 'yav', 'yaw', 'yax', 'yay', 'yaz', 'yb', 'yc', 'yd', 'ye', 'yeb', 'yec', 'yed', 'yef', 'yeg', 'yeh', 'yej', 'yek', 'yel', 'yem', 'yen', 'yep', 'yeq', 'yer', 'yes', 'yet', 'yev', 'yew', 'yex', 'yey', 'yez', 'yf', 'yg', 'yh', 'yi', 'yib', 'yic', 'yid', 'yif', 'yig', 'yih', 'yij', 'yik', 'yil', 'yim', 'yin', 'yip', 'yiq', 'yir', 'yis', 'yit', 'yiv', 'yiw', 'yix', 'yiy', 'yiz', 'yj', 'yk', 'yl', 'ym', 'yn', 'yo', 'yob', 'yoc', 'yod', 'yof', 'yog', 'yoh', 'yoj', 'yok', 'yol', 'yom', 'yon', 'yop', 'yoq', 'yor', 'yos', 'yot', 'yov', 'yow', 'yox', 'yoy', 'yoz', 'yp', 'yq', 'yr', 'ys', 'yt', 'yu', 'yub', 'yuc', 'yud', 'yuf', 'yug', 'yuh', 'yuj', 'yuk', 'yul', 'yum', 'yun', 'yup', 'yuq', 'yur', 'yus', 'yut', 'yuv', 'yuw', 'yux', 'yuy', 'yuz', 'yv', 'yw', 'yx', 'yy', 'yyb', 'yyc', 'yyd', 'yyf', 'yyg', 'yyh', 'yyj', 'yyk', 'yyl', 'yym', 'yyn', 'yyp', 'yyq', 'yyr', 'yys', 'yyt', 'yyv', 'yyw', 'yyx', 'yyy', 'yyz', 'yz', 
            
            'za', 'zab', 'zac', 'zad', 'zaf', 'zag', 'zah', 'zaj', 'zak', 'zal', 'zam', 'zan', 'zap', 'zaq', 'zar', 'zas', 'zat', 'zav', 'zaw', 'zax', 'zay', 'zaz', 'ze', 'zeb', 'zec', 'zed', 'zef', 'zeg', 'zeh', 'zej', 'zek', 'zel', 'zem', 'zen', 'zep', 'zeq', 'zer', 'zes', 'zet', 'zev', 'zew', 'zex', 'zey', 'zez', 'zi', 'zib', 'zic', 'zid', 'zif', 'zig', 'zih', 'zij', 'zik', 'zil', 'zim', 'zin', 'zip', 'ziq', 'zir', 'zis', 'zit', 'ziv', 'ziw', 'zix', 'ziy', 'ziz', 'zo', 'zob', 'zoc', 'zod', 'zof', 'zog', 'zoh', 'zoj', 'zok', 'zol', 'zom', 'zon', 'zop', 'zoq', 'zor', 'zos', 'zot', 'zov', 'zow', 'zox', 'zoy', 'zoz', 'zu', 'zub', 'zuc', 'zud', 'zuf', 'zug', 'zuh', 'zuj', 'zuk', 'zul', 'zum', 'zun', 'zup', 'zuq', 'zur', 'zus', 'zut', 'zuv', 'zuw', 'zux', 'zuy', 'zuz', 'zy', 'zyb', 'zyc', 'zyd', 'zyf', 'zyg', 'zyh', 'zyj', 'zyk', 'zyl', 'zym', 'zyn', 'zyp', 'zyq', 'zyr', 'zys', 'zyt', 'zyv', 'zyw', 'zyx', 'zyy', 'zyz',

             # Английский буквы с заглвной буквы

            'Ab', 'Ad', 'Al', 'Am', 'An', 'Ap', 'Ar', 'As', 'At', 'Ax', 'Ay', 
            
            'Ba', 'Be', 'Bi', 'Bo', 'Bu', 'By', 
            
            'Ca', 'Ce', 'Ci', 'Co', 'Cu', 'Cy', 
            
            'Da', 'De', 'Di', 'Do', 'Du', 'Dy', 
            
            'Ea', 'Ed', 'Ef', 'Eg', 'Eh', 'El', 'Em', 'En', 'Er', 'Es', 'Et', 'Ex', 
            
            'Fa', 'Fe', 'Fi', 'Fo', 'Fu', 'Fy', 
            
            'Ga', 'Ge', 'Gi', 'Go', 'Gu', 'Gy', 
            
            'Ha', 'He', 'Hi', 'Ho', 'Hu', 'Hy', 
            
            'Ia', 'Ib', 'Ic', 'Id', 'Ie', 'If', 'Ig', 'Ii', 'Ij', 'Ik', 'Il', 'Im', 'In', 'Io', 'Ip', 'Iq', 'Ir', 'Is', 'It', 'Iv', 'Iu', 'Ix', 'Iz', 
            
            'Ja', 'Je', 'Ji', 'Jo', 'Ju', 'Jy', 
            
            'Ka', 'Ke', 'Ki', 'Ko', 'Ku', 'Ky', 
            
            'La', 'Le', 'Li', 'Lo', 'Lu', 'Ly', 
            
            'Ma', 'Me', 'Mi', 'Mo', 'Mu', 'My', 
            
            'Na', 'Ne', 'Ni', 'No', 'Nu', 'Ny', 
            
            'Ob', 'Oc', 'Od', 'Of', 'Og', 'Oh', 'Oi', 'Oj', 'Ok', 'Ol', 'Om', 'On', 'Op', 'Or', 'Os', 'Ot', 'Ou', 'Ov', 'Ow', 'Ox', 'Oy', 
            
            'Pa', 'Pe', 'Pi', 'Po', 'Pu', 'Py', 
            
            'Ra', 'Re', 'Ri', 'Ro', 'Ru', 'Ry', 
            
            'Sa', 'Se', 'Si', 'So', 'Su', 'Sy', 
            
            'Ta', 'Te', 'Ti', 'To', 'Tu', 'Ty', 
            
            'Ua', 'Ub', 'Uc', 'Ud', 'Ue', 'Uf', 'Ug', 'Uh', 'Ui', 'Uj', 'Uk', 'Ul', 'Um', 'Un', 'Uo', 'Up', 'Ur', 'Us', 'Ut', 'Uv', 'Uw', 'Ux', 'Uy', 
            
            'Va', 'Ve', 'Vi', 'Vo', 'Vu', 'Vy', 
            
            'Wa', 'We', 'Wi', 'Wo', 'Wu', 'Wy', 
            
            'Xa', 'Xe', 'Xi', 'Xo', 'Xu', 
            
            'Ya', 'Ye', 'Yi', 'Yo', 'Yu', 
            
            'Za', 'Ze', 'Zi', 'Zo', 'Zu'
        ]

        self.initUI()

    def initUI(self):
        central_widget = QWidget()
        self.setCentralWidget(central_widget)
        layout = QVBoxLayout(central_widget)

        # Установка шрифта
        font = QFont("Segoe UI", 12)
        self.setFont(font)

        # Input for default tokens
        self.default_tokens_text_edit = QTextEdit()
        self.default_tokens_text_edit.setPlaceholderText("Токены по умолчанию")
        self.default_tokens_text_edit.setText(', '.join(self.default_tokens))  # Установка токенов по умолчанию
        self.default_tokens_text_edit.setStyleSheet("background-color: #2E2E2E; color: #FFFFFF; border: 1px solid #444;")
        self.default_tokens_text_edit.setFont(QFont("Segoe UI", 14))
        self.default_tokens_text_edit.setReadOnly(True)

        # Input for tokens from file
        self.file_tokens_text_edit = QTextEdit()
        self.file_tokens_text_edit.setPlaceholderText("Токены из файла")
        self.file_tokens_text_edit.setStyleSheet("background-color: #2E2E2E; color: #FFFFFF; border: 1px solid #444;")
        self.file_tokens_text_edit.setFont(QFont("Segoe UI", 14))

        # Поле для ввода vocab_size
        self.vocab_size_input = QSpinBox()
        self.vocab_size_input.setMinimum(1)
        self.vocab_size_input.setMaximum(1000000000)
        self.vocab_size_input.setValue(10240)  # Задано значение по умолчанию
        self.vocab_size_input.setStyleSheet("background-color: #2E2E2E; color: #FFFFFF; border: 1px solid #444;")
        self.vocab_size_input.setFont(QFont("Segoe UI", 14))

        # Поле для ввода max_len
        self.max_len_input = QSpinBox()
        self.max_len_input.setMinimum(1)
        self.max_len_input.setMaximum(1000000000)
        self.max_len_input.setValue(10240)  # Задано значение по умолчанию
        self.max_len_input.setStyleSheet("background-color: #2E2E2E; color: #FFFFFF; border: 1px solid #444;")
        self.max_len_input.setFont(QFont("Segoe UI", 14))

        # Output directory selection
        self.output_dir_line_edit = QLineEdit()
        self.output_dir_line_edit.setPlaceholderText("Выберите папку для сохранения")
        self.output_dir_line_edit.setStyleSheet("background-color: #2E2E2E; color: #FFFFFF; border: 1px solid #444;")
        self.output_dir_line_edit.setFont(QFont("Segoe UI", 14))

        self.output_dir_button = QPushButton("📂 Выбрать папку 📂")
        self.output_dir_button.setStyleSheet("background-color: #808080; color: #FFFFFF; border: none; padding: 10px; border-radius: 5px;")
        self.output_dir_button.setFont(QFont("Segoe UI", 14))
        self.output_dir_button.clicked.connect(self.select_output_dir)

        # Button for selecting input file
        self.input_file_button = QPushButton("📂 Выбрать файл с данными 📂")
        self.input_file_button.setStyleSheet("background-color: #808080; color: #FFFFFF; border: none; padding: 10px; border-radius: 5px;")
        self.input_file_button.setFont(QFont("Segoe UI", 14))
        self.input_file_button.clicked.connect(self.select_input_file)
        layout.addWidget(self.input_file_button)

        # Start button
        self.start_button = QPushButton("✅ Создать токенизатор ✅")
        self.start_button.setStyleSheet("background-color: #006400; color: #FFFFFF; border: none; padding: 10px; border-radius: 5px;")
        self.start_button.setFont(QFont("Segoe UI", 14))
        self.start_button.clicked.connect(self.create_tokenizer)

        # Label for displaying the number of tokens
        self.token_count_label = QLabel("Количество токенов: 0")
        self.token_count_label.setStyleSheet("color: #FFFFFF; font: 12pt 'Segoe UI';")
        layout.addWidget(self.token_count_label)

        # Layout setup
        form_layout = QFormLayout()
        form_layout.addRow(QLabel("📖 Токены по умолчанию 📖"), self.default_tokens_text_edit)
        form_layout.addRow(QLabel("📖 Токены из файла 📖"), self.file_tokens_text_edit)
        form_layout.addRow(QLabel("📑 Размер словаря (vocab_size) 📑"), self.vocab_size_input)
        form_layout.addRow(QLabel("📏 Максимальная длина (max_len) 📏"), self.max_len_input)
        form_layout.addRow(QLabel("📁 Папка для сохранения 📁"), self.output_dir_line_edit)
        form_layout.addRow(self.output_dir_button)

        layout.addLayout(form_layout)
        layout.addWidget(self.start_button)

        # Status bar
        self.status_bar = QStatusBar()
        self.setStatusBar(self.status_bar)
        self.status_bar.setStyleSheet("background-color: #333; color: #FFFFFF; font: 12pt 'Segoe UI';")

    def select_output_dir(self):
        dir_path = QFileDialog.getExistingDirectory(self, "Выберите папку для сохранения")
        if dir_path:
            self.output_dir_line_edit.setText(dir_path)

    def select_input_file(self):
        file_path, _ = QFileDialog.getOpenFileName(self, "Выберите файл с данными", "", "Text Files (*.txt);;All Files (*)")
        if file_path:
            with open(file_path, 'r', encoding='utf-8') as file:
                data = file.read()
                self.file_tokens_text_edit.setText(data)

    def create_tokenizer(self):
        output_dir = self.output_dir_line_edit.text()
        file_tokens_text = self.file_tokens_text_edit.toPlainText()
        default_tokens_text = self.default_tokens_text_edit.toPlainText()

        if not output_dir:
            self.status_bar.showMessage("Необходимо выбрать папку для сохранения.")
            return

        if not file_tokens_text and not default_tokens_text:
            self.status_bar.showMessage("Необходимо ввести токены.")
            return

        vocab_size = self.vocab_size_input.value()
        max_len = self.max_len_input.value()

        self.status_bar.showMessage("Создание токенизатора. Пожалуйста, подождите...")

        try:
            file_tokens = [token.strip() for token in file_tokens_text.split(',') if token.strip()]
            default_tokens = [token.strip() for token in default_tokens_text.split(',') if token.strip()]
            tokens = default_tokens + file_tokens
            self.generate_tokenizer(output_dir, tokens, vocab_size, max_len)
            self.status_bar.showMessage("Токенизатор успешно создан!")
            self.token_count_label.setText(f"Количество токенов: {len(tokens)}")
        except Exception as e:
            self.status_bar.showMessage(f"Ошибка: {str(e)}")

    def generate_tokenizer(self, output_dir, tokens, vocab_size, max_len):
        tokenizer = Tokenizer(models.BPE())
        tokenizer.pre_tokenizer = pre_tokenizers.ByteLevel(add_prefix_space=True)
        tokenizer.decoder = decoders.ByteLevel()

        trainer = trainers.BpeTrainer(
            vocab_size=vocab_size,
            special_tokens=tokens,
            show_progress=True
        )

        # Объединение токенов из файла и токенов по умолчанию
        data = self.file_tokens_text_edit.toPlainText().splitlines() + self.default_tokens_text_edit.toPlainText().splitlines()
        tokenizer.train_from_iterator(data, trainer)

        tokenizer_json_path = os.path.join(output_dir, "tokenizer.json")
        tokenizer.save(tokenizer_json_path)

        vocab = tokenizer.get_vocab()
        with open(os.path.join(output_dir, "vocab.json"), 'w', encoding='utf-8') as f:
            json.dump(vocab, f, ensure_ascii=False, indent=4)

        with open(tokenizer_json_path, 'r', encoding='utf-8') as f:
            tokenizer_data = json.load(f)
            merges = tokenizer_data['model']['merges']
            with open(os.path.join(output_dir, "merges.txt"), 'w', encoding='utf-8') as merges_file:
                for merge in merges:
                    merges_file.write(f"{merge}\n")

        # Добавляем специальные токены в файл special_tokens_map.json
        special_tokens = {
            "unk_token": "<unk>",
            "bos_token": "<s>",
            "eos_token": "</s>",
            "pad_token": "<pad>",
            "mask_token": "<mask>"
        }
        with open(os.path.join(output_dir, "special_tokens_map.json"), 'w', encoding='utf-8') as f:
            json.dump(special_tokens, f, ensure_ascii=False, indent=4)

        with open(os.path.join(output_dir, "tokenizer_config.json"), 'w', encoding='utf-8') as f:
            json.dump({
                "max_len": max_len,
                "do_lower_case": False
            }, f, ensure_ascii=False, indent=4)

if __name__ == "__main__":
    app = QApplication(sys.argv)
    window = TokenizerApp()
    window.show()
    sys.exit(app.exec())
